programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-01 Tue 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pacific Renewable Fuels LCFS Compliance Example</title>
<meta name="author" content="BOOST LCFS Implementation Team" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Pacific Renewable Fuels LCFS Compliance Example
<br />
<span class="subtitle">Lignocellulosic Biomass Feedstock to Renewable Diesel Production</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc0b41c2">1. Introduction</a>
<ul>
<li><a href="#org9bcfa6a">1.1. Business Scenario</a></li>
<li><a href="#orgb499ecd">1.2. Key LCFS Requirements</a></li>
<li><a href="#org60877fb">1.3. Document Structure</a></li>
</ul>
</li>
<li><a href="#org4c7acb1">2. Setup and Data Loading</a></li>
<li><a href="#org20607b5">3. Company Profile and BOOST Organization Entity</a>
<ul>
<li><a href="#org5bda664">3.1. Organization Overview</a></li>
<li><a href="#org1125e01">3.2. Verification</a></li>
</ul>
</li>
<li><a href="#org593db8d">4. Lignocellulosic Feedstock Portfolio</a>
<ul>
<li><a href="#org2d5be7e">4.1. Feedstock Material Entities</a></li>
<li><a href="#org13868cc">4.2. Feedstock Analysis</a></li>
</ul>
</li>
<li><a href="#org20bf97e">5. LCFS Certified Pathways</a>
<ul>
<li><a href="#orgb70ec82">5.1. LCFSPathway Entities</a></li>
<li><a href="#org6361a01">5.2. Pathway Portfolio Analysis</a></li>
</ul>
</li>
<li><a href="#org2baddfb">6. Q1 2025 Fuel Transaction Data</a>
<ul>
<li><a href="#org3f2b3f8">6.1. Transaction Entities</a></li>
<li><a href="#org24e8896">6.2. Transaction Summary Analysis</a></li>
</ul>
</li>
<li><a href="#org3cf481d">7. LCFS Credit Calculation Engine</a>
<ul>
<li><a href="#org2cf7db7">7.1. Energy Conversion Factors</a></li>
<li><a href="#org88f9632">7.2. Credit Calculation Functions</a></li>
<li><a href="#orgcaf7b7d">7.3. Q1 2025 Credit Calculations</a></li>
</ul>
</li>
<li><a href="#orgfd868fb">8. Energy and Carbon Data Entities</a>
<ul>
<li><a href="#orgaf98ae5">8.1. EnergyCarbonData Entities</a></li>
<li><a href="#orgfbf4489">8.2. Carbon Intensity Analysis</a></li>
</ul>
</li>
<li><a href="#org3be175f">9. LCFS Quarterly Report Generation</a>
<ul>
<li><a href="#orge9204ad">9.1. LCFSReporting Entity</a></li>
<li><a href="#org68fcbf4">9.2. CARB LRT-CBTS Report Format</a></li>
</ul>
</li>
<li><a href="#org60a2ec5">10. Data Validation and Compliance Checks</a>
<ul>
<li><a href="#org568eefc">10.1. Entity Validation Functions</a></li>
<li><a href="#org1c3bb34">10.2. Comprehensive Data Validation</a></li>
</ul>
</li>
<li><a href="#org5d99274">11. Implementation Summary and Next Steps</a>
<ul>
<li><a href="#org10292e8">11.1. Key Achievements</a></li>
<li><a href="#org4d7e725">11.2. Business Impact for Pacific Renewable Fuels</a></li>
<li><a href="#orga6a4ad5">11.3. Next Implementation Steps</a></li>
<li><a href="#org0194875">11.4. Technical Architecture</a></li>
</ul>
</li>
<li><a href="#org7841d62">12. Export Instructions</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc0b41c2" class="outline-2">
<h2 id="orgc0b41c2"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document demonstrates a complete LCFS (Low Carbon Fuel Standard) compliance workflow using the BOOST entity framework. We follow Pacific Renewable Fuels Corp, a renewable diesel producer who purchases diverse lignocellulosic biomass feedstocks and must report quarterly to CARB for LCFS crediting.
</p>
</div>
<div id="outline-container-org9bcfa6a" class="outline-3">
<h3 id="org9bcfa6a"><span class="section-number-3">1.1.</span> Business Scenario</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Pacific Renewable Fuels Corp operates a renewable diesel production facility in Stockton, California. The company:
</p>

<ul class="org-ul">
<li>Purchases lignocellulosic biomass from multiple sources</li>
<li>Converts biomass to renewable diesel using hydrotreating technology</li>
<li>Sells fuel to California distributors under LCFS-certified pathways</li>
<li>Must report quarterly fuel transactions to CARB for credit generation</li>
</ul>
</div>
</div>
<div id="outline-container-orgb499ecd" class="outline-3">
<h3 id="orgb499ecd"><span class="section-number-3">1.2.</span> Key LCFS Requirements</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><b>Pathway Certification</b>: All fuel production must use CARB-certified pathways</li>
<li><b>Carbon Intensity Tracking</b>: CI values must be verified using CA-GREET methodology</li>
<li><b>Quarterly Reporting</b>: Submit fuel transaction data within 45 days of quarter end</li>
<li><b>Credit Calculation</b>: Generate credits based on CI difference from regulatory benchmark</li>
<li><b>Third-Party Verification</b>: Annual verification of large fuel volumes</li>
</ol>
</div>
</div>
<div id="outline-container-org60877fb" class="outline-3">
<h3 id="org60877fb"><span class="section-number-3">1.3.</span> Document Structure</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This literate programming document contains executable source blocks that:
</p>
<ul class="org-ul">
<li>Generate realistic BOOST entity data</li>
<li>Perform LCFS credit calculations</li>
<li>Create CARB-compliant quarterly reports</li>
<li>Validate data quality and compliance</li>
</ul>
</div>
</div>
</div>
