programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
* Setup and Data Loading

#+begin_src python :session lcfs-analysis
import json
from collections import defaultdict
import re

# Load all JSON data for the analysis
print("Loading BOOST entity data for LCFS analysis...")

# Organization data
organization_data = {
  "organizationId": "pacific-renewable-fuels-001",
  "name": "Pacific Renewable Fuels Corp",
  "address": {
    "street": "2500 Industrial Parkway",
    "city": "Stockton", 
    "state": "CA",
    "postalCode": "95206",
    "country": "USA"
  },
  "contactInfo": {
    "email": "compliance@pacificrenewable.com",
    "phone": "+1-209-555-0150",
    "website": "https://www.pacificrenewable.com"
  },
  "lcfsRegistrationId": "LCFS-REG-2025-003",
  "regulatedEntityType": "producer",
  "facilityCapacity": {
    "annualCapacity": 50000000,
    "unit": "gallons_renewable_diesel"
  },
  "operationalStatus": "active",
  "lastUpdated": "2025-07-02T10:00:00Z"
}

# Feedstock materials data
feedstocks_data = [
  {
    "materialId": "feedstock-lumber-mill-residual-001",
    "materialType": "lumber_mill_residual",
    "description": "Sawdust and wood chips from lumber milling operations",
    "specification": {
      "moistureContent": 15.2,
      "ashContent": 2.1,
      "cellulose": 42.5,
      "hemicellulose": 27.3,
      "lignin": 28.1
    },
    "supplier": "Northern California Lumber Co-op",
    "originLocation": {
      "region": "Northern California",
      "sustainabilityCertification": "FSC_Chain_of_Custody"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 2.8,
      "transportCI": 1.2,
      "totalFeedstockCI": 4.0
    }
  },
  {
    "materialId": "feedstock-ag-residue-001", 
    "materialType": "agricultural_residue",
    "description": "Wheat straw and rice hulls from Central Valley farms",
    "specification": {
      "moistureContent": 12.5,
      "ashContent": 8.7,
      "cellulose": 38.2,
      "hemicellulose": 32.1,
      "lignin": 21.0
    },
    "supplier": "Central Valley Ag Residue Collective",
    "originLocation": {
      "region": "California Central Valley",
      "sustainabilityCertification": "CARB_Approved_Feedstock"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 1.5,
      "transportCI": 2.1,
      "totalFeedstockCI": 3.6
    }
  },
  {
    "materialId": "feedstock-green-waste-001",
    "materialType": "municipal_green_waste", 
    "description": "Yard trimmings and tree waste from municipal collection",
    "specification": {
      "moistureContent": 18.7,
      "ashContent": 4.3,
      "cellulose": 35.8,
      "hemicellulose": 25.2,
      "lignin": 34.7
    },
    "supplier": "Bay Area Green Waste Recovery",
    "originLocation": {
      "region": "San Francisco Bay Area",
      "sustainabilityCertification": "Municipal_Waste_Stream"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 0.8,
      "transportCI": 1.8,
      "totalFeedstockCI": 2.6
    }
  },
  {
    "materialId": "feedstock-forest-residual-001",
    "materialType": "forest_harvest_residual",
    "description": "Logging residue and forest thinning materials",
    "specification": {
      "moistureContent": 22.1,
      "ashContent": 1.9,
      "cellulose": 44.2,
      "hemicellulose": 29.8,
      "lignin": 24.1
    },
    "supplier": "Sierra Nevada Forest Products",
    "originLocation": {
      "region": "Sierra Nevada Foothills",
      "sustainabilityCertification": "SFI_Fiber_Sourcing"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 3.2,
      "transportCI": 2.4,
      "totalFeedstockCI": 5.6
    }
  }
]

# LCFS Pathways data
pathways_data = [
  {
    "pathwayId": "CA-RD-2025-LMR-001",
    "pathwayType": "Tier_1",
    "feedstockCategory": "lumber_mill_residual",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 18.7,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-15",
    "expirationDate": "2028-01-15", 
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Lumber mill residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 15000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-AGR-001", 
    "pathwayType": "Tier_1",
    "feedstockCategory": "agricultural_residue",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 16.2,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-20",
    "expirationDate": "2028-01-20",
    "verificationStatus": "active", 
    "caGreetVersion": "3.0",
    "pathwayDescription": "Agricultural residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 20000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-GRW-001",
    "pathwayType": "Tier_1", 
    "feedstockCategory": "municipal_green_waste",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 14.5,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-02-01",
    "expirationDate": "2028-02-01",
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Municipal green waste to renewable diesel via hydrotreating",
    "annualVolumeLimit": 10000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-FHR-001",
    "pathwayType": "Tier_1",
    "feedstockCategory": "forest_harvest_residual", 
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 21.3,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-10",
    "expirationDate": "2028-01-10",
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Forest harvest residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 8000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003", 
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  }
]

# Q1 2025 Transactions data
transactions_data = [
  {
    "transactionId": "TXN-2025-Q1-001",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-001",
    "transactionDate": "2025-01-15",
    "fuelVolume": 875000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel", 
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-LMR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Oakland",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-002",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001", 
    "customerOrganizationId": "ca-fuel-distributor-002",
    "transactionDate": "2025-01-28",
    "fuelVolume": 1250000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1", 
    "lcfsPathwayId": "CA-RD-2025-AGR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Fresno",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-003",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-003", 
    "transactionDate": "2025-02-12",
    "fuelVolume": 650000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-GRW-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "San Jose",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-004",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-001",
    "transactionDate": "2025-02-25",
    "fuelVolume": 425000.0,
    "fuelVolumeUnit": "gallons", 
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-FHR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Sacramento",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-005",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-002",
    "transactionDate": "2025-03-10",
    "fuelVolume": 1100000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-AGR-001", 
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Bakersfield",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-006",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-004",
    "transactionDate": "2025-03-22",
    "fuelVolume": 775000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-LMR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Los Angeles", 
      "state": "CA"
    }
  }
]

# Carbon intensity data
carbon_data_list = [
  {
    "energyCarbonDataId": "CI-2025-LMR-001",
    "dataCategory": "carbon_intensity",
    "value": 18.7,
    "unit": "gCO2e/MJ",
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1", 
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-10",
    "associatedPathway": "CA-RD-2025-LMR-001",
    "lcaBreakdown": {
      "feedstock": 4.0,
      "transport": 1.2,
      "processing": 12.8,
      "distribution": 0.7
    }
  },
  {
    "energyCarbonDataId": "CI-2025-AGR-001", 
    "dataCategory": "carbon_intensity",
    "value": 16.2,
    "unit": "gCO2e/MJ",
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1",
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-15",
    "associatedPathway": "CA-RD-2025-AGR-001",
    "lcaBreakdown": {
      "feedstock": 3.6,
      "transport": 2.1, 
      "processing": 10.1,
      "distribution": 0.4
    }
  },
  {
    "energyCarbonDataId": "CI-2025-GRW-001",
    "dataCategory": "carbon_intensity", 
    "value": 14.5,
    "unit": "gCO2e/MJ",
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1",
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-20",
    "associatedPathway": "CA-RD-2025-GRW-001",
    "lcaBreakdown": {
      "feedstock": 2.6,
      "transport": 1.8,
      "processing": 9.8,
      "distribution": 0.3
    }
  },
  {
    "energyCarbonDataId": "CI-2025-FHR-001",
    "dataCategory": "carbon_intensity",
    "value": 21.3,
    "unit": "gCO2e/MJ", 
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1",
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-05",
    "associatedPathway": "CA-RD-2025-FHR-001",
    "lcaBreakdown": {
      "feedstock": 5.6,
      "transport": 2.4,
      "processing": 12.8,
      "distribution": 0.5
    }
  }
]

# LCFS constants and conversion factors
ENERGY_CONVERSIONS = {
    'renewable_diesel': 138.7,  # MJ per gallon
    'gasoline': 121.3,
    'diesel': 138.7,
    'ethanol': 84.5,
    'hydrogen': 142.0  # MJ per kg
}

REGULATORY_BENCHMARKS_2025 = {
    'gasoline': 95.61,  # gCO2e/MJ
    'diesel': 95.61,
    'jet_fuel': 88.76
}

# Create lookup dictionaries
pathway_lookup = {p['pathwayId']: p for p in pathways_data}

print("✓ Organization data loaded")
print("✓ Feedstock materials data loaded")
print("✓ LCFS pathways data loaded")
print("✓ Q1 2025 transactions loaded")
print("✓ Carbon intensity data loaded")
print("✓ Conversion factors loaded")
print("✓ Python session initialized")
#+end_src

#+RESULTS:
: Loading BOOST entity data for LCFS analysis...
: ✓ Organization data loaded
: ✓ Feedstock materials data loaded
: ✓ LCFS pathways data loaded
: ✓ Q1 2025 transactions loaded
: ✓ Carbon intensity data loaded
: ✓ Conversion factors loaded
: ✓ Python session initialized

