programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org4c7acb1" class="outline-2">
<h2 id="org4c7acb1"><span class="section-number-2">2.</span> Setup and Data Loading</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF; font-weight: bold;">import</span> json
<span style="color: #0000FF; font-weight: bold;">from</span> collections <span style="color: #0000FF; font-weight: bold;">import</span> defaultdict
<span style="color: #0000FF; font-weight: bold;">import</span> re

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Load all JSON data for the analysis</span>
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Loading BOOST entity data for LCFS analysis..."</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Organization data</span>
<span style="color: #BA36A5;">organization_data</span> = {
  <span style="color: #008000;">"organizationId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>,
  <span style="color: #008000;">"name"</span>: <span style="color: #008000;">"Pacific Renewable Fuels Corp"</span>,
  <span style="color: #008000;">"address"</span>: {
    <span style="color: #008000;">"street"</span>: <span style="color: #008000;">"2500 Industrial Parkway"</span>,
    <span style="color: #008000;">"city"</span>: <span style="color: #008000;">"Stockton"</span>, 
    <span style="color: #008000;">"state"</span>: <span style="color: #008000;">"CA"</span>,
    <span style="color: #008000;">"postalCode"</span>: <span style="color: #008000;">"95206"</span>,
    <span style="color: #008000;">"country"</span>: <span style="color: #008000;">"USA"</span>
  },
  <span style="color: #008000;">"contactInfo"</span>: {
    <span style="color: #008000;">"email"</span>: <span style="color: #008000;">"compliance@pacificrenewable.com"</span>,
    <span style="color: #008000;">"phone"</span>: <span style="color: #008000;">"+1-209-555-0150"</span>,
    <span style="color: #008000;">"website"</span>: <span style="color: #008000;">"https://www.pacificrenewable.com"</span>
  },
  <span style="color: #008000;">"lcfsRegistrationId"</span>: <span style="color: #008000;">"LCFS-REG-2025-003"</span>,
  <span style="color: #008000;">"regulatedEntityType"</span>: <span style="color: #008000;">"producer"</span>,
  <span style="color: #008000;">"facilityCapacity"</span>: {
    <span style="color: #008000;">"annualCapacity"</span>: 50000000,
    <span style="color: #008000;">"unit"</span>: <span style="color: #008000;">"gallons_renewable_diesel"</span>
  },
  <span style="color: #008000;">"operationalStatus"</span>: <span style="color: #008000;">"active"</span>,
  <span style="color: #008000;">"lastUpdated"</span>: <span style="color: #008000;">"2025-07-02T10:00:00Z"</span>
}

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Feedstock materials data</span>
<span style="color: #BA36A5;">feedstocks_data</span> = [
  {
    <span style="color: #008000;">"materialId"</span>: <span style="color: #008000;">"feedstock-lumber-mill-residual-001"</span>,
    <span style="color: #008000;">"materialType"</span>: <span style="color: #008000;">"lumber_mill_residual"</span>,
    <span style="color: #008000;">"description"</span>: <span style="color: #008000;">"Sawdust and wood chips from lumber milling operations"</span>,
    <span style="color: #008000;">"specification"</span>: {
      <span style="color: #008000;">"moistureContent"</span>: 15.2,
      <span style="color: #008000;">"ashContent"</span>: 2.1,
      <span style="color: #008000;">"cellulose"</span>: 42.5,
      <span style="color: #008000;">"hemicellulose"</span>: 27.3,
      <span style="color: #008000;">"lignin"</span>: 28.1
    },
    <span style="color: #008000;">"supplier"</span>: <span style="color: #008000;">"Northern California Lumber Co-op"</span>,
    <span style="color: #008000;">"originLocation"</span>: {
      <span style="color: #008000;">"region"</span>: <span style="color: #008000;">"Northern California"</span>,
      <span style="color: #008000;">"sustainabilityCertification"</span>: <span style="color: #008000;">"FSC_Chain_of_Custody"</span>
    },
    <span style="color: #008000;">"carbonIntensityProfile"</span>: {
      <span style="color: #008000;">"feedstockCI"</span>: 2.8,
      <span style="color: #008000;">"transportCI"</span>: 1.2,
      <span style="color: #008000;">"totalFeedstockCI"</span>: 4.0
    }
  },
  {
    <span style="color: #008000;">"materialId"</span>: <span style="color: #008000;">"feedstock-ag-residue-001"</span>, 
    <span style="color: #008000;">"materialType"</span>: <span style="color: #008000;">"agricultural_residue"</span>,
    <span style="color: #008000;">"description"</span>: <span style="color: #008000;">"Wheat straw and rice hulls from Central Valley farms"</span>,
    <span style="color: #008000;">"specification"</span>: {
      <span style="color: #008000;">"moistureContent"</span>: 12.5,
      <span style="color: #008000;">"ashContent"</span>: 8.7,
      <span style="color: #008000;">"cellulose"</span>: 38.2,
      <span style="color: #008000;">"hemicellulose"</span>: 32.1,
      <span style="color: #008000;">"lignin"</span>: 21.0
    },
    <span style="color: #008000;">"supplier"</span>: <span style="color: #008000;">"Central Valley Ag Residue Collective"</span>,
    <span style="color: #008000;">"originLocation"</span>: {
      <span style="color: #008000;">"region"</span>: <span style="color: #008000;">"California Central Valley"</span>,
      <span style="color: #008000;">"sustainabilityCertification"</span>: <span style="color: #008000;">"CARB_Approved_Feedstock"</span>
    },
    <span style="color: #008000;">"carbonIntensityProfile"</span>: {
      <span style="color: #008000;">"feedstockCI"</span>: 1.5,
      <span style="color: #008000;">"transportCI"</span>: 2.1,
      <span style="color: #008000;">"totalFeedstockCI"</span>: 3.6
    }
  },
  {
    <span style="color: #008000;">"materialId"</span>: <span style="color: #008000;">"feedstock-green-waste-001"</span>,
    <span style="color: #008000;">"materialType"</span>: <span style="color: #008000;">"municipal_green_waste"</span>, 
    <span style="color: #008000;">"description"</span>: <span style="color: #008000;">"Yard trimmings and tree waste from municipal collection"</span>,
    <span style="color: #008000;">"specification"</span>: {
      <span style="color: #008000;">"moistureContent"</span>: 18.7,
      <span style="color: #008000;">"ashContent"</span>: 4.3,
      <span style="color: #008000;">"cellulose"</span>: 35.8,
      <span style="color: #008000;">"hemicellulose"</span>: 25.2,
      <span style="color: #008000;">"lignin"</span>: 34.7
    },
    <span style="color: #008000;">"supplier"</span>: <span style="color: #008000;">"Bay Area Green Waste Recovery"</span>,
    <span style="color: #008000;">"originLocation"</span>: {
      <span style="color: #008000;">"region"</span>: <span style="color: #008000;">"San Francisco Bay Area"</span>,
      <span style="color: #008000;">"sustainabilityCertification"</span>: <span style="color: #008000;">"Municipal_Waste_Stream"</span>
    },
    <span style="color: #008000;">"carbonIntensityProfile"</span>: {
      <span style="color: #008000;">"feedstockCI"</span>: 0.8,
      <span style="color: #008000;">"transportCI"</span>: 1.8,
      <span style="color: #008000;">"totalFeedstockCI"</span>: 2.6
    }
  },
  {
    <span style="color: #008000;">"materialId"</span>: <span style="color: #008000;">"feedstock-forest-residual-001"</span>,
    <span style="color: #008000;">"materialType"</span>: <span style="color: #008000;">"forest_harvest_residual"</span>,
    <span style="color: #008000;">"description"</span>: <span style="color: #008000;">"Logging residue and forest thinning materials"</span>,
    <span style="color: #008000;">"specification"</span>: {
      <span style="color: #008000;">"moistureContent"</span>: 22.1,
      <span style="color: #008000;">"ashContent"</span>: 1.9,
      <span style="color: #008000;">"cellulose"</span>: 44.2,
      <span style="color: #008000;">"hemicellulose"</span>: 29.8,
      <span style="color: #008000;">"lignin"</span>: 24.1
    },
    <span style="color: #008000;">"supplier"</span>: <span style="color: #008000;">"Sierra Nevada Forest Products"</span>,
    <span style="color: #008000;">"originLocation"</span>: {
      <span style="color: #008000;">"region"</span>: <span style="color: #008000;">"Sierra Nevada Foothills"</span>,
      <span style="color: #008000;">"sustainabilityCertification"</span>: <span style="color: #008000;">"SFI_Fiber_Sourcing"</span>
    },
    <span style="color: #008000;">"carbonIntensityProfile"</span>: {
      <span style="color: #008000;">"feedstockCI"</span>: 3.2,
      <span style="color: #008000;">"transportCI"</span>: 2.4,
      <span style="color: #008000;">"totalFeedstockCI"</span>: 5.6
    }
  }
]

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">LCFS Pathways data</span>
<span style="color: #BA36A5;">pathways_data</span> = [
  {
    <span style="color: #008000;">"pathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-LMR-001"</span>,
    <span style="color: #008000;">"pathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>,
    <span style="color: #008000;">"feedstockCategory"</span>: <span style="color: #008000;">"lumber_mill_residual"</span>,
    <span style="color: #008000;">"fuelProduct"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"facilityLocation"</span>: <span style="color: #008000;">"Stockton, California, USA"</span>,
    <span style="color: #008000;">"carbonIntensity"</span>: 18.7,
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"certificationDate"</span>: <span style="color: #008000;">"2025-01-15"</span>,
    <span style="color: #008000;">"expirationDate"</span>: <span style="color: #008000;">"2028-01-15"</span>, 
    <span style="color: #008000;">"verificationStatus"</span>: <span style="color: #008000;">"active"</span>,
    <span style="color: #008000;">"caGreetVersion"</span>: <span style="color: #008000;">"3.0"</span>,
    <span style="color: #008000;">"pathwayDescription"</span>: <span style="color: #008000;">"Lumber mill residue to renewable diesel via hydrotreating"</span>,
    <span style="color: #008000;">"annualVolumeLimit"</span>: 15000000,
    <span style="color: #008000;">"facility"</span>: {
      <span style="color: #008000;">"facilityId"</span>: <span style="color: #008000;">"CARB-FAC-2025-003"</span>,
      <span style="color: #008000;">"operatorName"</span>: <span style="color: #008000;">"Pacific Renewable Fuels Corp"</span>
    }
  },
  {
    <span style="color: #008000;">"pathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-AGR-001"</span>, 
    <span style="color: #008000;">"pathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>,
    <span style="color: #008000;">"feedstockCategory"</span>: <span style="color: #008000;">"agricultural_residue"</span>,
    <span style="color: #008000;">"fuelProduct"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"facilityLocation"</span>: <span style="color: #008000;">"Stockton, California, USA"</span>,
    <span style="color: #008000;">"carbonIntensity"</span>: 16.2,
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"certificationDate"</span>: <span style="color: #008000;">"2025-01-20"</span>,
    <span style="color: #008000;">"expirationDate"</span>: <span style="color: #008000;">"2028-01-20"</span>,
    <span style="color: #008000;">"verificationStatus"</span>: <span style="color: #008000;">"active"</span>, 
    <span style="color: #008000;">"caGreetVersion"</span>: <span style="color: #008000;">"3.0"</span>,
    <span style="color: #008000;">"pathwayDescription"</span>: <span style="color: #008000;">"Agricultural residue to renewable diesel via hydrotreating"</span>,
    <span style="color: #008000;">"annualVolumeLimit"</span>: 20000000,
    <span style="color: #008000;">"facility"</span>: {
      <span style="color: #008000;">"facilityId"</span>: <span style="color: #008000;">"CARB-FAC-2025-003"</span>,
      <span style="color: #008000;">"operatorName"</span>: <span style="color: #008000;">"Pacific Renewable Fuels Corp"</span>
    }
  },
  {
    <span style="color: #008000;">"pathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-GRW-001"</span>,
    <span style="color: #008000;">"pathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>, 
    <span style="color: #008000;">"feedstockCategory"</span>: <span style="color: #008000;">"municipal_green_waste"</span>,
    <span style="color: #008000;">"fuelProduct"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"facilityLocation"</span>: <span style="color: #008000;">"Stockton, California, USA"</span>,
    <span style="color: #008000;">"carbonIntensity"</span>: 14.5,
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"certificationDate"</span>: <span style="color: #008000;">"2025-02-01"</span>,
    <span style="color: #008000;">"expirationDate"</span>: <span style="color: #008000;">"2028-02-01"</span>,
    <span style="color: #008000;">"verificationStatus"</span>: <span style="color: #008000;">"active"</span>,
    <span style="color: #008000;">"caGreetVersion"</span>: <span style="color: #008000;">"3.0"</span>,
    <span style="color: #008000;">"pathwayDescription"</span>: <span style="color: #008000;">"Municipal green waste to renewable diesel via hydrotreating"</span>,
    <span style="color: #008000;">"annualVolumeLimit"</span>: 10000000,
    <span style="color: #008000;">"facility"</span>: {
      <span style="color: #008000;">"facilityId"</span>: <span style="color: #008000;">"CARB-FAC-2025-003"</span>,
      <span style="color: #008000;">"operatorName"</span>: <span style="color: #008000;">"Pacific Renewable Fuels Corp"</span>
    }
  },
  {
    <span style="color: #008000;">"pathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-FHR-001"</span>,
    <span style="color: #008000;">"pathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>,
    <span style="color: #008000;">"feedstockCategory"</span>: <span style="color: #008000;">"forest_harvest_residual"</span>, 
    <span style="color: #008000;">"fuelProduct"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"facilityLocation"</span>: <span style="color: #008000;">"Stockton, California, USA"</span>,
    <span style="color: #008000;">"carbonIntensity"</span>: 21.3,
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"certificationDate"</span>: <span style="color: #008000;">"2025-01-10"</span>,
    <span style="color: #008000;">"expirationDate"</span>: <span style="color: #008000;">"2028-01-10"</span>,
    <span style="color: #008000;">"verificationStatus"</span>: <span style="color: #008000;">"active"</span>,
    <span style="color: #008000;">"caGreetVersion"</span>: <span style="color: #008000;">"3.0"</span>,
    <span style="color: #008000;">"pathwayDescription"</span>: <span style="color: #008000;">"Forest harvest residue to renewable diesel via hydrotreating"</span>,
    <span style="color: #008000;">"annualVolumeLimit"</span>: 8000000,
    <span style="color: #008000;">"facility"</span>: {
      <span style="color: #008000;">"facilityId"</span>: <span style="color: #008000;">"CARB-FAC-2025-003"</span>, 
      <span style="color: #008000;">"operatorName"</span>: <span style="color: #008000;">"Pacific Renewable Fuels Corp"</span>
    }
  }
]

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Q1 2025 Transactions data</span>
<span style="color: #BA36A5;">transactions_data</span> = [
  {
    <span style="color: #008000;">"transactionId"</span>: <span style="color: #008000;">"TXN-2025-Q1-001"</span>,
    <span style="color: #008000;">"transactionType"</span>: <span style="color: #008000;">"fuel_sale"</span>,
    <span style="color: #008000;">"supplyingOrganizationId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>,
    <span style="color: #008000;">"customerOrganizationId"</span>: <span style="color: #008000;">"ca-fuel-distributor-001"</span>,
    <span style="color: #008000;">"transactionDate"</span>: <span style="color: #008000;">"2025-01-15"</span>,
    <span style="color: #008000;">"fuelVolume"</span>: 875000.0,
    <span style="color: #008000;">"fuelVolumeUnit"</span>: <span style="color: #008000;">"gallons"</span>,
    <span style="color: #008000;">"fuelCategory"</span>: <span style="color: #008000;">"renewable_diesel"</span>, 
    <span style="color: #008000;">"reportingPeriod"</span>: <span style="color: #008000;">"2025-Q1"</span>,
    <span style="color: #008000;">"lcfsPathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-LMR-001"</span>,
    <span style="color: #008000;">"regulatedPartyRole"</span>: <span style="color: #008000;">"producer"</span>,
    <span style="color: #008000;">"deliveryLocation"</span>: {
      <span style="color: #008000;">"city"</span>: <span style="color: #008000;">"Oakland"</span>,
      <span style="color: #008000;">"state"</span>: <span style="color: #008000;">"CA"</span>
    }
  },
  {
    <span style="color: #008000;">"transactionId"</span>: <span style="color: #008000;">"TXN-2025-Q1-002"</span>,
    <span style="color: #008000;">"transactionType"</span>: <span style="color: #008000;">"fuel_sale"</span>,
    <span style="color: #008000;">"supplyingOrganizationId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>, 
    <span style="color: #008000;">"customerOrganizationId"</span>: <span style="color: #008000;">"ca-fuel-distributor-002"</span>,
    <span style="color: #008000;">"transactionDate"</span>: <span style="color: #008000;">"2025-01-28"</span>,
    <span style="color: #008000;">"fuelVolume"</span>: 1250000.0,
    <span style="color: #008000;">"fuelVolumeUnit"</span>: <span style="color: #008000;">"gallons"</span>,
    <span style="color: #008000;">"fuelCategory"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"reportingPeriod"</span>: <span style="color: #008000;">"2025-Q1"</span>, 
    <span style="color: #008000;">"lcfsPathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-AGR-001"</span>,
    <span style="color: #008000;">"regulatedPartyRole"</span>: <span style="color: #008000;">"producer"</span>,
    <span style="color: #008000;">"deliveryLocation"</span>: {
      <span style="color: #008000;">"city"</span>: <span style="color: #008000;">"Fresno"</span>,
      <span style="color: #008000;">"state"</span>: <span style="color: #008000;">"CA"</span>
    }
  },
  {
    <span style="color: #008000;">"transactionId"</span>: <span style="color: #008000;">"TXN-2025-Q1-003"</span>,
    <span style="color: #008000;">"transactionType"</span>: <span style="color: #008000;">"fuel_sale"</span>,
    <span style="color: #008000;">"supplyingOrganizationId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>,
    <span style="color: #008000;">"customerOrganizationId"</span>: <span style="color: #008000;">"ca-fuel-distributor-003"</span>, 
    <span style="color: #008000;">"transactionDate"</span>: <span style="color: #008000;">"2025-02-12"</span>,
    <span style="color: #008000;">"fuelVolume"</span>: 650000.0,
    <span style="color: #008000;">"fuelVolumeUnit"</span>: <span style="color: #008000;">"gallons"</span>,
    <span style="color: #008000;">"fuelCategory"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"reportingPeriod"</span>: <span style="color: #008000;">"2025-Q1"</span>,
    <span style="color: #008000;">"lcfsPathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-GRW-001"</span>,
    <span style="color: #008000;">"regulatedPartyRole"</span>: <span style="color: #008000;">"producer"</span>,
    <span style="color: #008000;">"deliveryLocation"</span>: {
      <span style="color: #008000;">"city"</span>: <span style="color: #008000;">"San Jose"</span>,
      <span style="color: #008000;">"state"</span>: <span style="color: #008000;">"CA"</span>
    }
  },
  {
    <span style="color: #008000;">"transactionId"</span>: <span style="color: #008000;">"TXN-2025-Q1-004"</span>,
    <span style="color: #008000;">"transactionType"</span>: <span style="color: #008000;">"fuel_sale"</span>,
    <span style="color: #008000;">"supplyingOrganizationId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>,
    <span style="color: #008000;">"customerOrganizationId"</span>: <span style="color: #008000;">"ca-fuel-distributor-001"</span>,
    <span style="color: #008000;">"transactionDate"</span>: <span style="color: #008000;">"2025-02-25"</span>,
    <span style="color: #008000;">"fuelVolume"</span>: 425000.0,
    <span style="color: #008000;">"fuelVolumeUnit"</span>: <span style="color: #008000;">"gallons"</span>, 
    <span style="color: #008000;">"fuelCategory"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"reportingPeriod"</span>: <span style="color: #008000;">"2025-Q1"</span>,
    <span style="color: #008000;">"lcfsPathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-FHR-001"</span>,
    <span style="color: #008000;">"regulatedPartyRole"</span>: <span style="color: #008000;">"producer"</span>,
    <span style="color: #008000;">"deliveryLocation"</span>: {
      <span style="color: #008000;">"city"</span>: <span style="color: #008000;">"Sacramento"</span>,
      <span style="color: #008000;">"state"</span>: <span style="color: #008000;">"CA"</span>
    }
  },
  {
    <span style="color: #008000;">"transactionId"</span>: <span style="color: #008000;">"TXN-2025-Q1-005"</span>,
    <span style="color: #008000;">"transactionType"</span>: <span style="color: #008000;">"fuel_sale"</span>,
    <span style="color: #008000;">"supplyingOrganizationId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>,
    <span style="color: #008000;">"customerOrganizationId"</span>: <span style="color: #008000;">"ca-fuel-distributor-002"</span>,
    <span style="color: #008000;">"transactionDate"</span>: <span style="color: #008000;">"2025-03-10"</span>,
    <span style="color: #008000;">"fuelVolume"</span>: 1100000.0,
    <span style="color: #008000;">"fuelVolumeUnit"</span>: <span style="color: #008000;">"gallons"</span>,
    <span style="color: #008000;">"fuelCategory"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"reportingPeriod"</span>: <span style="color: #008000;">"2025-Q1"</span>,
    <span style="color: #008000;">"lcfsPathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-AGR-001"</span>, 
    <span style="color: #008000;">"regulatedPartyRole"</span>: <span style="color: #008000;">"producer"</span>,
    <span style="color: #008000;">"deliveryLocation"</span>: {
      <span style="color: #008000;">"city"</span>: <span style="color: #008000;">"Bakersfield"</span>,
      <span style="color: #008000;">"state"</span>: <span style="color: #008000;">"CA"</span>
    }
  },
  {
    <span style="color: #008000;">"transactionId"</span>: <span style="color: #008000;">"TXN-2025-Q1-006"</span>,
    <span style="color: #008000;">"transactionType"</span>: <span style="color: #008000;">"fuel_sale"</span>,
    <span style="color: #008000;">"supplyingOrganizationId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>,
    <span style="color: #008000;">"customerOrganizationId"</span>: <span style="color: #008000;">"ca-fuel-distributor-004"</span>,
    <span style="color: #008000;">"transactionDate"</span>: <span style="color: #008000;">"2025-03-22"</span>,
    <span style="color: #008000;">"fuelVolume"</span>: 775000.0,
    <span style="color: #008000;">"fuelVolumeUnit"</span>: <span style="color: #008000;">"gallons"</span>,
    <span style="color: #008000;">"fuelCategory"</span>: <span style="color: #008000;">"renewable_diesel"</span>,
    <span style="color: #008000;">"reportingPeriod"</span>: <span style="color: #008000;">"2025-Q1"</span>,
    <span style="color: #008000;">"lcfsPathwayId"</span>: <span style="color: #008000;">"CA-RD-2025-LMR-001"</span>,
    <span style="color: #008000;">"regulatedPartyRole"</span>: <span style="color: #008000;">"producer"</span>,
    <span style="color: #008000;">"deliveryLocation"</span>: {
      <span style="color: #008000;">"city"</span>: <span style="color: #008000;">"Los Angeles"</span>, 
      <span style="color: #008000;">"state"</span>: <span style="color: #008000;">"CA"</span>
    }
  }
]

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Carbon intensity data</span>
<span style="color: #BA36A5;">carbon_data_list</span> = [
  {
    <span style="color: #008000;">"energyCarbonDataId"</span>: <span style="color: #008000;">"CI-2025-LMR-001"</span>,
    <span style="color: #008000;">"dataCategory"</span>: <span style="color: #008000;">"carbon_intensity"</span>,
    <span style="color: #008000;">"value"</span>: 18.7,
    <span style="color: #008000;">"unit"</span>: <span style="color: #008000;">"gCO2e/MJ"</span>,
    <span style="color: #008000;">"source"</span>: <span style="color: #008000;">"Third-party verification by Environmental Resources Management"</span>,
    <span style="color: #008000;">"measurementMethod"</span>: <span style="color: #008000;">"CA-GREET3.0"</span>,
    <span style="color: #008000;">"lcfsPathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>, 
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"lifeCycleStage"</span>: <span style="color: #008000;">"production"</span>,
    <span style="color: #008000;">"regulatoryBenchmark"</span>: 95.61,
    <span style="color: #008000;">"verificationDate"</span>: <span style="color: #008000;">"2025-01-10"</span>,
    <span style="color: #008000;">"associatedPathway"</span>: <span style="color: #008000;">"CA-RD-2025-LMR-001"</span>,
    <span style="color: #008000;">"lcaBreakdown"</span>: {
      <span style="color: #008000;">"feedstock"</span>: 4.0,
      <span style="color: #008000;">"transport"</span>: 1.2,
      <span style="color: #008000;">"processing"</span>: 12.8,
      <span style="color: #008000;">"distribution"</span>: 0.7
    }
  },
  {
    <span style="color: #008000;">"energyCarbonDataId"</span>: <span style="color: #008000;">"CI-2025-AGR-001"</span>, 
    <span style="color: #008000;">"dataCategory"</span>: <span style="color: #008000;">"carbon_intensity"</span>,
    <span style="color: #008000;">"value"</span>: 16.2,
    <span style="color: #008000;">"unit"</span>: <span style="color: #008000;">"gCO2e/MJ"</span>,
    <span style="color: #008000;">"source"</span>: <span style="color: #008000;">"Third-party verification by Environmental Resources Management"</span>,
    <span style="color: #008000;">"measurementMethod"</span>: <span style="color: #008000;">"CA-GREET3.0"</span>,
    <span style="color: #008000;">"lcfsPathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>,
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"lifeCycleStage"</span>: <span style="color: #008000;">"production"</span>,
    <span style="color: #008000;">"regulatoryBenchmark"</span>: 95.61,
    <span style="color: #008000;">"verificationDate"</span>: <span style="color: #008000;">"2025-01-15"</span>,
    <span style="color: #008000;">"associatedPathway"</span>: <span style="color: #008000;">"CA-RD-2025-AGR-001"</span>,
    <span style="color: #008000;">"lcaBreakdown"</span>: {
      <span style="color: #008000;">"feedstock"</span>: 3.6,
      <span style="color: #008000;">"transport"</span>: 2.1, 
      <span style="color: #008000;">"processing"</span>: 10.1,
      <span style="color: #008000;">"distribution"</span>: 0.4
    }
  },
  {
    <span style="color: #008000;">"energyCarbonDataId"</span>: <span style="color: #008000;">"CI-2025-GRW-001"</span>,
    <span style="color: #008000;">"dataCategory"</span>: <span style="color: #008000;">"carbon_intensity"</span>, 
    <span style="color: #008000;">"value"</span>: 14.5,
    <span style="color: #008000;">"unit"</span>: <span style="color: #008000;">"gCO2e/MJ"</span>,
    <span style="color: #008000;">"source"</span>: <span style="color: #008000;">"Third-party verification by Environmental Resources Management"</span>,
    <span style="color: #008000;">"measurementMethod"</span>: <span style="color: #008000;">"CA-GREET3.0"</span>,
    <span style="color: #008000;">"lcfsPathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>,
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"lifeCycleStage"</span>: <span style="color: #008000;">"production"</span>,
    <span style="color: #008000;">"regulatoryBenchmark"</span>: 95.61,
    <span style="color: #008000;">"verificationDate"</span>: <span style="color: #008000;">"2025-01-20"</span>,
    <span style="color: #008000;">"associatedPathway"</span>: <span style="color: #008000;">"CA-RD-2025-GRW-001"</span>,
    <span style="color: #008000;">"lcaBreakdown"</span>: {
      <span style="color: #008000;">"feedstock"</span>: 2.6,
      <span style="color: #008000;">"transport"</span>: 1.8,
      <span style="color: #008000;">"processing"</span>: 9.8,
      <span style="color: #008000;">"distribution"</span>: 0.3
    }
  },
  {
    <span style="color: #008000;">"energyCarbonDataId"</span>: <span style="color: #008000;">"CI-2025-FHR-001"</span>,
    <span style="color: #008000;">"dataCategory"</span>: <span style="color: #008000;">"carbon_intensity"</span>,
    <span style="color: #008000;">"value"</span>: 21.3,
    <span style="color: #008000;">"unit"</span>: <span style="color: #008000;">"gCO2e/MJ"</span>, 
    <span style="color: #008000;">"source"</span>: <span style="color: #008000;">"Third-party verification by Environmental Resources Management"</span>,
    <span style="color: #008000;">"measurementMethod"</span>: <span style="color: #008000;">"CA-GREET3.0"</span>,
    <span style="color: #008000;">"lcfsPathwayType"</span>: <span style="color: #008000;">"Tier_1"</span>,
    <span style="color: #008000;">"energyEconomyRatio"</span>: 1.0,
    <span style="color: #008000;">"lifeCycleStage"</span>: <span style="color: #008000;">"production"</span>,
    <span style="color: #008000;">"regulatoryBenchmark"</span>: 95.61,
    <span style="color: #008000;">"verificationDate"</span>: <span style="color: #008000;">"2025-01-05"</span>,
    <span style="color: #008000;">"associatedPathway"</span>: <span style="color: #008000;">"CA-RD-2025-FHR-001"</span>,
    <span style="color: #008000;">"lcaBreakdown"</span>: {
      <span style="color: #008000;">"feedstock"</span>: 5.6,
      <span style="color: #008000;">"transport"</span>: 2.4,
      <span style="color: #008000;">"processing"</span>: 12.8,
      <span style="color: #008000;">"distribution"</span>: 0.5
    }
  }
]

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">LCFS constants and conversion factors</span>
<span style="color: #BA36A5;">ENERGY_CONVERSIONS</span> = {
    <span style="color: #008000;">'renewable_diesel'</span>: 138.7,  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">MJ per gallon</span>
    <span style="color: #008000;">'gasoline'</span>: 121.3,
    <span style="color: #008000;">'diesel'</span>: 138.7,
    <span style="color: #008000;">'ethanol'</span>: 84.5,
    <span style="color: #008000;">'hydrogen'</span>: 142.0  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">MJ per kg</span>
}

<span style="color: #BA36A5;">REGULATORY_BENCHMARKS_2025</span> = {
    <span style="color: #008000;">'gasoline'</span>: 95.61,  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">gCO2e/MJ</span>
    <span style="color: #008000;">'diesel'</span>: 95.61,
    <span style="color: #008000;">'jet_fuel'</span>: 88.76
}

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Create lookup dictionaries</span>
<span style="color: #BA36A5;">pathway_lookup</span> = {p[<span style="color: #008000;">'pathwayId'</span>]: p <span style="color: #0000FF; font-weight: bold;">for</span> p <span style="color: #0000FF; font-weight: bold;">in</span> pathways_data}

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; Organization data loaded"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; Feedstock materials data loaded"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; LCFS pathways data loaded"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; Q1 2025 transactions loaded"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; Carbon intensity data loaded"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; Conversion factors loaded"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; Python session initialized"</span>)
</pre>
</div>

<pre class="example">
Loading BOOST entity data for LCFS analysis...
✓ Organization data loaded
✓ Feedstock materials data loaded
✓ LCFS pathways data loaded
✓ Q1 2025 transactions loaded
✓ Carbon intensity data loaded
✓ Conversion factors loaded
✓ Python session initialized
</pre>
</div>
</div>
