programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org20607b5" class="outline-2">
<h2 id="org20607b5"><span class="section-number-2">3.</span> Company Profile and BOOST Organization Entity</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5bda664" class="outline-3">
<h3 id="org5bda664"><span class="section-number-3">3.1.</span> Organization Overview</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Pacific Renewable Fuels Corp is a mid-sized renewable fuel producer specializing in lignocellulosic feedstocks.
</p>

<div class="org-src-container">
<pre class="src src-json" id="org98739f9">{
  "organizationId": "pacific-renewable-fuels-001",
  "name": "Pacific Renewable Fuels Corp",
  "address": {
    "street": "2500 Industrial Parkway",
    "city": "Stockton", 
    "state": "CA",
    "postalCode": "95206",
    "country": "USA"
  },
  "contactInfo": {
    "email": "compliance@pacificrenewable.com",
    "phone": "+1-209-555-0150",
    "website": "https://www.pacificrenewable.com"
  },
  "lcfsRegistrationId": "LCFS-REG-2025-003",
  "regulatedEntityType": "producer",
  "facilityCapacity": {
    "annualCapacity": 50000000,
    "unit": "gallons_renewable_diesel"
  },
  "operationalStatus": "active",
  "lastUpdated": "2025-07-02T10:00:00Z"
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org1125e01" class="outline-3">
<h3 id="org1125e01"><span class="section-number-3">3.2.</span> Verification</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate organization data from session</span>
<span style="color: #BA36A5;">org</span> = organization_data

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Organization Validation:"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Company: </span>{org['name']}<span style="color: #008000;">"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; LCFS Registration: </span>{org['lcfsRegistrationId']}<span style="color: #008000;">"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Entity Type: </span>{org['regulatedEntityType']}<span style="color: #008000;">"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Annual Capacity: </span>{org['facilityCapacity']['annualCapacity']:,}<span style="color: #008000;"> gallons"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Location: </span>{org['address']['city']}<span style="color: #008000;">, </span>{org['address']['state']}<span style="color: #008000;">"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate required LCFS attributes</span>
<span style="color: #BA36A5;">required_attrs</span> = [<span style="color: #008000;">'lcfsRegistrationId'</span>, <span style="color: #008000;">'regulatedEntityType'</span>]
<span style="color: #BA36A5;">missing</span> = [attr <span style="color: #0000FF; font-weight: bold;">for</span> attr <span style="color: #0000FF; font-weight: bold;">in</span> required_attrs <span style="color: #0000FF; font-weight: bold;">if</span> attr <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> org]
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">Required LCFS Attributes: </span>{'&#10003; Complete' <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #0000FF; font-weight: bold;">not</span> missing <span style="color: #0000FF; font-weight: bold;">else</span> '&#10007; Missing: ' + <span style="color: #006FE0;">str</span>(missing)}<span style="color: #008000;">"</span>)
</pre>
</div>

<pre class="example">
Organization Validation:
✓ Company: Pacific Renewable Fuels Corp
✓ LCFS Registration: LCFS-REG-2025-003
✓ Entity Type: producer
✓ Annual Capacity: 50,000,000 gallons
✓ Location: Stockton, CA

Required LCFS Attributes: ✓ Complete
</pre>
</div>
</div>
</div>
<div id="outline-container-org593db8d" class="outline-2">
<h2 id="org593db8d"><span class="section-number-2">4.</span> Lignocellulosic Feedstock Portfolio</h2>
<div class="outline-text-2" id="text-4">
<p>
Pacific Renewable Fuels sources biomass from four primary categories of lignocellulosic feedstock, each with distinct carbon intensity profiles.
</p>
</div>
<div id="outline-container-org2d5be7e" class="outline-3">
<h3 id="org2d5be7e"><span class="section-number-3">4.1.</span> Feedstock Material Entities</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-json" id="orgea28542">[
  {
    "materialId": "feedstock-lumber-mill-residual-001",
    "materialType": "lumber_mill_residual",
    "description": "Sawdust and wood chips from lumber milling operations",
    "specification": {
      "moistureContent": 15.2,
      "ashContent": 2.1,
      "cellulose": 42.5,
      "hemicellulose": 27.3,
      "lignin": 28.1
    },
    "supplier": "Northern California Lumber Co-op",
    "originLocation": {
      "region": "Northern California",
      "sustainabilityCertification": "FSC_Chain_of_Custody"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 2.8,
      "transportCI": 1.2,
      "totalFeedstockCI": 4.0
    }
  },
  {
    "materialId": "feedstock-ag-residue-001", 
    "materialType": "agricultural_residue",
    "description": "Wheat straw and rice hulls from Central Valley farms",
    "specification": {
      "moistureContent": 12.5,
      "ashContent": 8.7,
      "cellulose": 38.2,
      "hemicellulose": 32.1,
      "lignin": 21.0
    },
    "supplier": "Central Valley Ag Residue Collective",
    "originLocation": {
      "region": "California Central Valley",
      "sustainabilityCertification": "CARB_Approved_Feedstock"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 1.5,
      "transportCI": 2.1,
      "totalFeedstockCI": 3.6
    }
  },
  {
    "materialId": "feedstock-green-waste-001",
    "materialType": "municipal_green_waste", 
    "description": "Yard trimmings and tree waste from municipal collection",
    "specification": {
      "moistureContent": 18.7,
      "ashContent": 4.3,
      "cellulose": 35.8,
      "hemicellulose": 25.2,
      "lignin": 34.7
    },
    "supplier": "Bay Area Green Waste Recovery",
    "originLocation": {
      "region": "San Francisco Bay Area",
      "sustainabilityCertification": "Municipal_Waste_Stream"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 0.8,
      "transportCI": 1.8,
      "totalFeedstockCI": 2.6
    }
  },
  {
    "materialId": "feedstock-forest-residual-001",
    "materialType": "forest_harvest_residual",
    "description": "Logging residue and forest thinning materials",
    "specification": {
      "moistureContent": 22.1,
      "ashContent": 1.9,
      "cellulose": 44.2,
      "hemicellulose": 29.8,
      "lignin": 24.1
    },
    "supplier": "Sierra Nevada Forest Products",
    "originLocation": {
      "region": "Sierra Nevada Foothills",
      "sustainabilityCertification": "SFI_Fiber_Sourcing"
    },
    "carbonIntensityProfile": {
      "feedstockCI": 3.2,
      "transportCI": 2.4,
      "totalFeedstockCI": 5.6
    }
  }
]
</pre>
</div>
</div>
</div>
