programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** Feedstock Analysis

#+begin_src python :session lcfs-analysis
# Analyze feedstock data from session

print("Feedstock Portfolio Analysis:")
print("="*50)

total_ci_weighted = 0
for i, feedstock in enumerate(feedstocks_data, 1):
    material_type = feedstock['materialType']
    total_ci = feedstock['carbonIntensityProfile']['totalFeedstockCI']
    
    print(f"{i}. {feedstock['description']}")
    print(f"   Type: {material_type}")
    print(f"   Supplier: {feedstock['supplier']}")
    print(f"   Total Feedstock CI: {total_ci} gCO2e/MJ")
    print(f"   Certification: {feedstock['originLocation']['sustainabilityCertification']}")
    print()

# Calculate CI statistics
ci_values = [f['carbonIntensityProfile']['totalFeedstockCI'] for f in feedstocks_data]
print(f"Feedstock CI Statistics:")
print(f"  Minimum: {min(ci_values)} gCO2e/MJ")
print(f"  Maximum: {max(ci_values)} gCO2e/MJ")
print(f"  Average: {sum(ci_values)/len(ci_values):.2f} gCO2e/MJ")
#+end_src

#+RESULTS:
#+begin_example
Feedstock Portfolio Analysis:
==================================================
1. Sawdust and wood chips from lumber milling operations
   Type: lumber_mill_residual
   Supplier: Northern California Lumber Co-op
   Total Feedstock CI: 4.0 gCO2e/MJ
   Certification: FSC_Chain_of_Custody

2. Wheat straw and rice hulls from Central Valley farms
   Type: agricultural_residue
   Supplier: Central Valley Ag Residue Collective
   Total Feedstock CI: 3.6 gCO2e/MJ
   Certification: CARB_Approved_Feedstock

3. Yard trimmings and tree waste from municipal collection
   Type: municipal_green_waste
   Supplier: Bay Area Green Waste Recovery
   Total Feedstock CI: 2.6 gCO2e/MJ
   Certification: Municipal_Waste_Stream

4. Logging residue and forest thinning materials
   Type: forest_harvest_residual
   Supplier: Sierra Nevada Forest Products
   Total Feedstock CI: 5.6 gCO2e/MJ
   Certification: SFI_Fiber_Sourcing

Feedstock CI Statistics:
  Minimum: 2.6 gCO2e/MJ
  Maximum: 5.6 gCO2e/MJ
  Average: 3.95 gCO2e/MJ
#+end_example

* LCFS Certified Pathways

Each feedstock type corresponds to a CARB-certified pathway for renewable diesel production.

** LCFSPathway Entities

#+begin_src json :tangle lcfs_pathways.json
[
  {
    "pathwayId": "CA-RD-2025-LMR-001",
    "pathwayType": "Tier_1",
    "feedstockCategory": "lumber_mill_residual",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 18.7,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-15",
    "expirationDate": "2028-01-15", 
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Lumber mill residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 15000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-AGR-001", 
    "pathwayType": "Tier_1",
    "feedstockCategory": "agricultural_residue",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 16.2,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-20",
    "expirationDate": "2028-01-20",
    "verificationStatus": "active", 
    "caGreetVersion": "3.0",
    "pathwayDescription": "Agricultural residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 20000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-GRW-001",
    "pathwayType": "Tier_1", 
    "feedstockCategory": "municipal_green_waste",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 14.5,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-02-01",
    "expirationDate": "2028-02-01",
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Municipal green waste to renewable diesel via hydrotreating",
    "annualVolumeLimit": 10000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-FHR-001",
    "pathwayType": "Tier_1",
    "feedstockCategory": "forest_harvest_residual", 
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 21.3,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-10",
    "expirationDate": "2028-01-10",
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Forest harvest residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 8000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003", 
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  }
]
#+end_src

