programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org13868cc" class="outline-3">
<h3 id="org13868cc"><span class="section-number-3">4.2.</span> Feedstock Analysis</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Analyze feedstock data from session</span>

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Feedstock Portfolio Analysis:"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*50)

<span style="color: #BA36A5;">total_ci_weighted</span> = 0
<span style="color: #0000FF; font-weight: bold;">for</span> i, feedstock <span style="color: #0000FF; font-weight: bold;">in</span> <span style="color: #006FE0;">enumerate</span>(feedstocks_data, 1):
    <span style="color: #BA36A5;">material_type</span> = feedstock[<span style="color: #008000;">'materialType'</span>]
    <span style="color: #BA36A5;">total_ci</span> = feedstock[<span style="color: #008000;">'carbonIntensityProfile'</span>][<span style="color: #008000;">'totalFeedstockCI'</span>]
    
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"</span>{i}<span style="color: #008000;">. </span>{feedstock['description']}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   Type: </span>{material_type}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   Supplier: </span>{feedstock['supplier']}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   Total Feedstock CI: </span>{total_ci}<span style="color: #008000;"> gCO2e/MJ"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   Certification: </span>{feedstock['originLocation']['sustainabilityCertification']}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>()

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Calculate CI statistics</span>
<span style="color: #BA36A5;">ci_values</span> = [f[<span style="color: #008000;">'carbonIntensityProfile'</span>][<span style="color: #008000;">'totalFeedstockCI'</span>] <span style="color: #0000FF; font-weight: bold;">for</span> f <span style="color: #0000FF; font-weight: bold;">in</span> feedstocks_data]
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Feedstock CI Statistics:"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Minimum: </span>{<span style="color: #006FE0;">min</span>(ci_values)}<span style="color: #008000;"> gCO2e/MJ"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Maximum: </span>{<span style="color: #006FE0;">max</span>(ci_values)}<span style="color: #008000;"> gCO2e/MJ"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Average: </span>{<span style="color: #006FE0;">sum</span>(ci_values)/<span style="color: #006FE0;">len</span>(ci_values):.2f}<span style="color: #008000;"> gCO2e/MJ"</span>)
</pre>
</div>

<pre class="example" id="org557c057">
Feedstock Portfolio Analysis:
==================================================
1. Sawdust and wood chips from lumber milling operations
   Type: lumber_mill_residual
   Supplier: Northern California Lumber Co-op
   Total Feedstock CI: 4.0 gCO2e/MJ
   Certification: FSC_Chain_of_Custody

2. Wheat straw and rice hulls from Central Valley farms
   Type: agricultural_residue
   Supplier: Central Valley Ag Residue Collective
   Total Feedstock CI: 3.6 gCO2e/MJ
   Certification: CARB_Approved_Feedstock

3. Yard trimmings and tree waste from municipal collection
   Type: municipal_green_waste
   Supplier: Bay Area Green Waste Recovery
   Total Feedstock CI: 2.6 gCO2e/MJ
   Certification: Municipal_Waste_Stream

4. Logging residue and forest thinning materials
   Type: forest_harvest_residual
   Supplier: Sierra Nevada Forest Products
   Total Feedstock CI: 5.6 gCO2e/MJ
   Certification: SFI_Fiber_Sourcing

Feedstock CI Statistics:
  Minimum: 2.6 gCO2e/MJ
  Maximum: 5.6 gCO2e/MJ
  Average: 3.95 gCO2e/MJ
</pre>
</div>
</div>
</div>
<div id="outline-container-org20bf97e" class="outline-2">
<h2 id="org20bf97e"><span class="section-number-2">5.</span> LCFS Certified Pathways</h2>
<div class="outline-text-2" id="text-5">
<p>
Each feedstock type corresponds to a CARB-certified pathway for renewable diesel production.
</p>
</div>
<div id="outline-container-orgb70ec82" class="outline-3">
<h3 id="orgb70ec82"><span class="section-number-3">5.1.</span> LCFSPathway Entities</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-json">[
  {
    "pathwayId": "CA-RD-2025-LMR-001",
    "pathwayType": "Tier_1",
    "feedstockCategory": "lumber_mill_residual",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 18.7,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-15",
    "expirationDate": "2028-01-15", 
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Lumber mill residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 15000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-AGR-001", 
    "pathwayType": "Tier_1",
    "feedstockCategory": "agricultural_residue",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 16.2,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-20",
    "expirationDate": "2028-01-20",
    "verificationStatus": "active", 
    "caGreetVersion": "3.0",
    "pathwayDescription": "Agricultural residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 20000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-GRW-001",
    "pathwayType": "Tier_1", 
    "feedstockCategory": "municipal_green_waste",
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 14.5,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-02-01",
    "expirationDate": "2028-02-01",
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Municipal green waste to renewable diesel via hydrotreating",
    "annualVolumeLimit": 10000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003",
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  },
  {
    "pathwayId": "CA-RD-2025-FHR-001",
    "pathwayType": "Tier_1",
    "feedstockCategory": "forest_harvest_residual", 
    "fuelProduct": "renewable_diesel",
    "facilityLocation": "Stockton, California, USA",
    "carbonIntensity": 21.3,
    "energyEconomyRatio": 1.0,
    "certificationDate": "2025-01-10",
    "expirationDate": "2028-01-10",
    "verificationStatus": "active",
    "caGreetVersion": "3.0",
    "pathwayDescription": "Forest harvest residue to renewable diesel via hydrotreating",
    "annualVolumeLimit": 8000000,
    "facility": {
      "facilityId": "CARB-FAC-2025-003", 
      "operatorName": "Pacific Renewable Fuels Corp"
    }
  }
]
</pre>
</div>
</div>
</div>
