programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** Pathway Portfolio Analysis

#+begin_src python :session lcfs-analysis
# Analyze pathway portfolio from session data

print("LCFS Pathway Portfolio:")
print("="*40)

total_capacity = 0
ci_values = []

for pathway in pathways_data:
    feedstock = pathway['feedstockCategory']
    ci = pathway['carbonIntensity']
    capacity = pathway['annualVolumeLimit']
    
    print(f"Pathway: {pathway['pathwayId']}")
    print(f"  Feedstock: {feedstock}")
    print(f"  Carbon Intensity: {ci} gCO2e/MJ")
    print(f"  Annual Limit: {capacity:,} gallons")
    print(f"  Status: {pathway['verificationStatus']}")
    print()
    
    total_capacity += capacity
    ci_values.append(ci)

print(f"Portfolio Summary:")
print(f"  Total Annual Capacity: {total_capacity:,} gallons")
print(f"  Portfolio Average CI: {sum(ci_values)/len(ci_values):.1f} gCO2e/MJ")
print(f"  CI Range: {min(ci_values)} - {max(ci_values)} gCO2e/MJ")

# Calculate potential credit generation (vs 2025 gasoline benchmark)
gasoline_benchmark = 95.61  # 2025 LCFS gasoline benchmark
print(f"\nCredit Generation Potential (vs {gasoline_benchmark} gCO2e/MJ benchmark):")
for pathway in pathways_data:
    ci_diff = gasoline_benchmark - pathway['carbonIntensity']
    print(f"  {pathway['feedstockCategory']}: {ci_diff:.1f} gCO2e/MJ credit intensity")
#+end_src

#+RESULTS:
#+begin_example
LCFS Pathway Portfolio:
========================================
Pathway: CA-RD-2025-LMR-001
  Feedstock: lumber_mill_residual
  Carbon Intensity: 18.7 gCO2e/MJ
  Annual Limit: 15,000,000 gallons
  Status: active

Pathway: CA-RD-2025-AGR-001
  Feedstock: agricultural_residue
  Carbon Intensity: 16.2 gCO2e/MJ
  Annual Limit: 20,000,000 gallons
  Status: active

Pathway: CA-RD-2025-GRW-001
  Feedstock: municipal_green_waste
  Carbon Intensity: 14.5 gCO2e/MJ
  Annual Limit: 10,000,000 gallons
  Status: active

Pathway: CA-RD-2025-FHR-001
  Feedstock: forest_harvest_residual
  Carbon Intensity: 21.3 gCO2e/MJ
  Annual Limit: 8,000,000 gallons
  Status: active

Portfolio Summary:
  Total Annual Capacity: 53,000,000 gallons
  Portfolio Average CI: 17.7 gCO2e/MJ
  CI Range: 14.5 - 21.3 gCO2e/MJ

Credit Generation Potential (vs 95.61 gCO2e/MJ benchmark):
  lumber_mill_residual: 76.9 gCO2e/MJ credit intensity
  agricultural_residue: 79.4 gCO2e/MJ credit intensity
  municipal_green_waste: 81.1 gCO2e/MJ credit intensity
  forest_harvest_residual: 74.3 gCO2e/MJ credit intensity
#+end_example

* Q1 2025 Fuel Transaction Data

This section contains all fuel transactions for Q1 2025, including feedstock purchases and renewable diesel sales.

** Transaction Entities

#+begin_src json :tangle transactions_q1_2025.json
[
  {
    "transactionId": "TXN-2025-Q1-001",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-001",
    "transactionDate": "2025-01-15",
    "fuelVolume": 875000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel", 
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-LMR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Oakland",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-002",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001", 
    "customerOrganizationId": "ca-fuel-distributor-002",
    "transactionDate": "2025-01-28",
    "fuelVolume": 1250000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1", 
    "lcfsPathwayId": "CA-RD-2025-AGR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Fresno",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-003",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-003", 
    "transactionDate": "2025-02-12",
    "fuelVolume": 650000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-GRW-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "San Jose",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-004",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-001",
    "transactionDate": "2025-02-25",
    "fuelVolume": 425000.0,
    "fuelVolumeUnit": "gallons", 
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-FHR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Sacramento",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-005",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-002",
    "transactionDate": "2025-03-10",
    "fuelVolume": 1100000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-AGR-001", 
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Bakersfield",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-006",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-004",
    "transactionDate": "2025-03-22",
    "fuelVolume": 775000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-LMR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Los Angeles", 
      "state": "CA"
    }
  }
]
#+end_src

