programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org6361a01" class="outline-3">
<h3 id="org6361a01"><span class="section-number-3">5.2.</span> Pathway Portfolio Analysis</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Analyze pathway portfolio from session data</span>

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"LCFS Pathway Portfolio:"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*40)

<span style="color: #BA36A5;">total_capacity</span> = 0
<span style="color: #BA36A5;">ci_values</span> = []

<span style="color: #0000FF; font-weight: bold;">for</span> pathway <span style="color: #0000FF; font-weight: bold;">in</span> pathways_data:
    <span style="color: #BA36A5;">feedstock</span> = pathway[<span style="color: #008000;">'feedstockCategory'</span>]
    <span style="color: #BA36A5;">ci</span> = pathway[<span style="color: #008000;">'carbonIntensity'</span>]
    <span style="color: #BA36A5;">capacity</span> = pathway[<span style="color: #008000;">'annualVolumeLimit'</span>]
    
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Pathway: </span>{pathway['pathwayId']}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Feedstock: </span>{feedstock}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Carbon Intensity: </span>{ci}<span style="color: #008000;"> gCO2e/MJ"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Annual Limit: </span>{capacity:,}<span style="color: #008000;"> gallons"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Status: </span>{pathway['verificationStatus']}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>()
    
    <span style="color: #BA36A5;">total_capacity</span> += capacity
    ci_values.append(ci)

<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Portfolio Summary:"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Total Annual Capacity: </span>{total_capacity:,}<span style="color: #008000;"> gallons"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Portfolio Average CI: </span>{<span style="color: #006FE0;">sum</span>(ci_values)/<span style="color: #006FE0;">len</span>(ci_values):.1f}<span style="color: #008000;"> gCO2e/MJ"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  CI Range: </span>{<span style="color: #006FE0;">min</span>(ci_values)}<span style="color: #008000;"> - </span>{<span style="color: #006FE0;">max</span>(ci_values)}<span style="color: #008000;"> gCO2e/MJ"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Calculate potential credit generation (vs 2025 gasoline benchmark)</span>
<span style="color: #BA36A5;">gasoline_benchmark</span> = 95.61  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">2025 LCFS gasoline benchmark</span>
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">Credit Generation Potential (vs </span>{gasoline_benchmark}<span style="color: #008000;"> gCO2e/MJ benchmark):"</span>)
<span style="color: #0000FF; font-weight: bold;">for</span> pathway <span style="color: #0000FF; font-weight: bold;">in</span> pathways_data:
    <span style="color: #BA36A5;">ci_diff</span> = gasoline_benchmark - pathway[<span style="color: #008000;">'carbonIntensity'</span>]
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  </span>{pathway['feedstockCategory']}<span style="color: #008000;">: </span>{ci_diff:.1f}<span style="color: #008000;"> gCO2e/MJ credit intensity"</span>)
</pre>
</div>

<pre class="example" id="org5e75692">
LCFS Pathway Portfolio:
========================================
Pathway: CA-RD-2025-LMR-001
  Feedstock: lumber_mill_residual
  Carbon Intensity: 18.7 gCO2e/MJ
  Annual Limit: 15,000,000 gallons
  Status: active

Pathway: CA-RD-2025-AGR-001
  Feedstock: agricultural_residue
  Carbon Intensity: 16.2 gCO2e/MJ
  Annual Limit: 20,000,000 gallons
  Status: active

Pathway: CA-RD-2025-GRW-001
  Feedstock: municipal_green_waste
  Carbon Intensity: 14.5 gCO2e/MJ
  Annual Limit: 10,000,000 gallons
  Status: active

Pathway: CA-RD-2025-FHR-001
  Feedstock: forest_harvest_residual
  Carbon Intensity: 21.3 gCO2e/MJ
  Annual Limit: 8,000,000 gallons
  Status: active

Portfolio Summary:
  Total Annual Capacity: 53,000,000 gallons
  Portfolio Average CI: 17.7 gCO2e/MJ
  CI Range: 14.5 - 21.3 gCO2e/MJ

Credit Generation Potential (vs 95.61 gCO2e/MJ benchmark):
  lumber_mill_residual: 76.9 gCO2e/MJ credit intensity
  agricultural_residue: 79.4 gCO2e/MJ credit intensity
  municipal_green_waste: 81.1 gCO2e/MJ credit intensity
  forest_harvest_residual: 74.3 gCO2e/MJ credit intensity
</pre>
</div>
</div>
</div>
<div id="outline-container-org2baddfb" class="outline-2">
<h2 id="org2baddfb"><span class="section-number-2">6.</span> Q1 2025 Fuel Transaction Data</h2>
<div class="outline-text-2" id="text-6">
<p>
This section contains all fuel transactions for Q1 2025, including feedstock purchases and renewable diesel sales.
</p>
</div>
<div id="outline-container-org3f2b3f8" class="outline-3">
<h3 id="org3f2b3f8"><span class="section-number-3">6.1.</span> Transaction Entities</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-json">[
  {
    "transactionId": "TXN-2025-Q1-001",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-001",
    "transactionDate": "2025-01-15",
    "fuelVolume": 875000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel", 
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-LMR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Oakland",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-002",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001", 
    "customerOrganizationId": "ca-fuel-distributor-002",
    "transactionDate": "2025-01-28",
    "fuelVolume": 1250000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1", 
    "lcfsPathwayId": "CA-RD-2025-AGR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Fresno",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-003",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-003", 
    "transactionDate": "2025-02-12",
    "fuelVolume": 650000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-GRW-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "San Jose",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-004",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-001",
    "transactionDate": "2025-02-25",
    "fuelVolume": 425000.0,
    "fuelVolumeUnit": "gallons", 
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-FHR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Sacramento",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-005",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-002",
    "transactionDate": "2025-03-10",
    "fuelVolume": 1100000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-AGR-001", 
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Bakersfield",
      "state": "CA"
    }
  },
  {
    "transactionId": "TXN-2025-Q1-006",
    "transactionType": "fuel_sale",
    "supplyingOrganizationId": "pacific-renewable-fuels-001",
    "customerOrganizationId": "ca-fuel-distributor-004",
    "transactionDate": "2025-03-22",
    "fuelVolume": 775000.0,
    "fuelVolumeUnit": "gallons",
    "fuelCategory": "renewable_diesel",
    "reportingPeriod": "2025-Q1",
    "lcfsPathwayId": "CA-RD-2025-LMR-001",
    "regulatedPartyRole": "producer",
    "deliveryLocation": {
      "city": "Los Angeles", 
      "state": "CA"
    }
  }
]
</pre>
</div>
</div>
</div>
