programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** Transaction Summary Analysis

#+begin_src python :session lcfs-analysis
# Analyze transaction data from session

print("Q1 2025 Transaction Summary:")
print("="*35)

# Analyze transactions by pathway
pathway_volumes = defaultdict(float)
total_volume = 0

for txn in transactions_data:
    pathway_id = txn['lcfsPathwayId']
    volume = txn['fuelVolume']
    
    pathway_volumes[pathway_id] += volume
    total_volume += volume

print(f"Total Fuel Volume: {total_volume:,} gallons\n")

print("Volume by Pathway:")
for pathway_id, volume in pathway_volumes.items():
    pathway = pathway_lookup[pathway_id]
    feedstock = pathway['feedstockCategory']
    ci = pathway['carbonIntensity']
    percentage = (volume / total_volume) * 100
    
    print(f"  {feedstock}:")
    print(f"    Volume: {volume:,} gallons ({percentage:.1f}%)")
    print(f"    Pathway: {pathway_id}")
    print(f"    CI: {ci} gCO2e/MJ")
    print()

print(f"Average Portfolio CI: {sum(pathway_lookup[pid]['carbonIntensity'] * vol for pid, vol in pathway_volumes.items()) / total_volume:.2f} gCO2e/MJ")
#+end_src

#+RESULTS:
#+begin_example
Q1 2025 Transaction Summary:
===================================
Total Fuel Volume: 5,075,000.0 gallons

Volume by Pathway:
  lumber_mill_residual:
    Volume: 1,650,000.0 gallons (32.5%)
    Pathway: CA-RD-2025-LMR-001
    CI: 18.7 gCO2e/MJ

  agricultural_residue:
    Volume: 2,350,000.0 gallons (46.3%)
    Pathway: CA-RD-2025-AGR-001
    CI: 16.2 gCO2e/MJ

  municipal_green_waste:
    Volume: 650,000.0 gallons (12.8%)
    Pathway: CA-RD-2025-GRW-001
    CI: 14.5 gCO2e/MJ

  forest_harvest_residual:
    Volume: 425,000.0 gallons (8.4%)
    Pathway: CA-RD-2025-FHR-001
    CI: 21.3 gCO2e/MJ

Average Portfolio CI: 17.22 gCO2e/MJ
#+end_example

* LCFS Credit Calculation Engine

This section implements the complete LCFS credit calculation methodology using the transaction and pathway data.

** Energy Conversion Factors

#+begin_src python :session lcfs-analysis
# Display energy conversion factors and benchmarks (already loaded in session)

print("LCFS Conversion Factors and Benchmarks:")
print("="*45)
print("Energy Conversion Factors (MJ per unit):")
for fuel, factor in ENERGY_CONVERSIONS.items():
    print(f"  {fuel}: {factor} MJ/gallon")

print(f"\n2025 Regulatory Benchmarks (gCO2e/MJ):")
for fuel, benchmark in REGULATORY_BENCHMARKS_2025.items():
    print(f"  {fuel}: {benchmark}")
#+end_src

#+RESULTS:
#+begin_example
LCFS Conversion Factors and Benchmarks:
=============================================
Energy Conversion Factors (MJ per unit):
  renewable_diesel: 138.7 MJ/gallon
  gasoline: 121.3 MJ/gallon
  diesel: 138.7 MJ/gallon
  ethanol: 84.5 MJ/gallon
  hydrogen: 142.0 MJ/gallon

2025 Regulatory Benchmarks (gCO2e/MJ):
  gasoline: 95.61
  diesel: 95.61
  jet_fuel: 88.76
#+end_example

** Credit Calculation Functions

#+begin_src python :session lcfs-analysis
def convert_to_mj(volume, volume_unit, fuel_type):
    """Convert fuel volume to megajoules"""
    if volume_unit == 'gallons':
        return volume * ENERGY_CONVERSIONS.get(fuel_type, 138.7)
    elif volume_unit == 'liters':
        return volume * ENERGY_CONVERSIONS.get(fuel_type, 138.7) / 3.78541
    else:
        raise ValueError(f"Unsupported volume unit: {volume_unit}")

def calculate_lcfs_credits(transaction, pathway, benchmark_ci):
    """Calculate LCFS credits for a single transaction"""
    
    # Convert fuel volume to energy units (MJ)
    fuel_volume_mj = convert_to_mj(
        transaction['fuelVolume'],
        transaction['fuelVolumeUnit'], 
        transaction['fuelCategory']
    )
    
    # Calculate carbon intensity difference
    ci_difference = benchmark_ci - pathway['carbonIntensity']
    
    # Apply Energy Economy Ratio
    eer = pathway['energyEconomyRatio']
    
    # Calculate credits (positive) or deficits (negative)
    credit_calculation = ci_difference * fuel_volume_mj * eer
    
    return {
        'transaction_id': transaction['transactionId'],
        'fuel_volume_mj': fuel_volume_mj,
        'pathway_ci': pathway['carbonIntensity'],
        'benchmark_ci': benchmark_ci,
        'ci_difference': ci_difference,
        'eer': eer,
        'credits': max(credit_calculation, 0),
        'deficits': abs(min(credit_calculation, 0)),
        'net_credits': credit_calculation
    }

print("LCFS Credit Calculation Functions Loaded ✓")
#+end_src

#+RESULTS:
: LCFS Credit Calculation Functions Loaded ✓

