programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org24e8896" class="outline-3">
<h3 id="org24e8896"><span class="section-number-3">6.2.</span> Transaction Summary Analysis</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Analyze transaction data from session</span>

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Q1 2025 Transaction Summary:"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*35)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Analyze transactions by pathway</span>
<span style="color: #BA36A5;">pathway_volumes</span> = defaultdict(<span style="color: #006FE0;">float</span>)
<span style="color: #BA36A5;">total_volume</span> = 0

<span style="color: #0000FF; font-weight: bold;">for</span> txn <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data:
    <span style="color: #BA36A5;">pathway_id</span> = txn[<span style="color: #008000;">'lcfsPathwayId'</span>]
    <span style="color: #BA36A5;">volume</span> = txn[<span style="color: #008000;">'fuelVolume'</span>]
    
    <span style="color: #BA36A5;">pathway_volumes</span>[pathway_id] += volume
    <span style="color: #BA36A5;">total_volume</span> += volume

<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Total Fuel Volume: </span>{total_volume:,}<span style="color: #008000;"> gallons</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">"</span>)

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Volume by Pathway:"</span>)
<span style="color: #0000FF; font-weight: bold;">for</span> pathway_id, volume <span style="color: #0000FF; font-weight: bold;">in</span> pathway_volumes.items():
    <span style="color: #BA36A5;">pathway</span> = pathway_lookup[pathway_id]
    <span style="color: #BA36A5;">feedstock</span> = pathway[<span style="color: #008000;">'feedstockCategory'</span>]
    <span style="color: #BA36A5;">ci</span> = pathway[<span style="color: #008000;">'carbonIntensity'</span>]
    <span style="color: #BA36A5;">percentage</span> = (volume / total_volume) * 100
    
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  </span>{feedstock}<span style="color: #008000;">:"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"    Volume: </span>{volume:,}<span style="color: #008000;"> gallons (</span>{percentage:.1f}<span style="color: #008000;">%)"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"    Pathway: </span>{pathway_id}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"    CI: </span>{ci}<span style="color: #008000;"> gCO2e/MJ"</span>)
    <span style="color: #006FE0;">print</span>()

<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Average Portfolio CI: </span>{<span style="color: #006FE0;">sum</span>(pathway_lookup[pid]['carbonIntensity'] * vol <span style="color: #0000FF; font-weight: bold;">for</span> pid, vol <span style="color: #0000FF; font-weight: bold;">in</span> pathway_volumes.items()) / total_volume:.2f}<span style="color: #008000;"> gCO2e/MJ"</span>)
</pre>
</div>

<pre class="example" id="orge573432">
Q1 2025 Transaction Summary:
===================================
Total Fuel Volume: 5,075,000.0 gallons

Volume by Pathway:
  lumber_mill_residual:
    Volume: 1,650,000.0 gallons (32.5%)
    Pathway: CA-RD-2025-LMR-001
    CI: 18.7 gCO2e/MJ

  agricultural_residue:
    Volume: 2,350,000.0 gallons (46.3%)
    Pathway: CA-RD-2025-AGR-001
    CI: 16.2 gCO2e/MJ

  municipal_green_waste:
    Volume: 650,000.0 gallons (12.8%)
    Pathway: CA-RD-2025-GRW-001
    CI: 14.5 gCO2e/MJ

  forest_harvest_residual:
    Volume: 425,000.0 gallons (8.4%)
    Pathway: CA-RD-2025-FHR-001
    CI: 21.3 gCO2e/MJ

Average Portfolio CI: 17.22 gCO2e/MJ
</pre>
</div>
</div>
</div>
<div id="outline-container-org3cf481d" class="outline-2">
<h2 id="org3cf481d"><span class="section-number-2">7.</span> LCFS Credit Calculation Engine</h2>
<div class="outline-text-2" id="text-7">
<p>
This section implements the complete LCFS credit calculation methodology using the transaction and pathway data.
</p>
</div>
<div id="outline-container-org2cf7db7" class="outline-3">
<h3 id="org2cf7db7"><span class="section-number-3">7.1.</span> Energy Conversion Factors</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Display energy conversion factors and benchmarks (already loaded in session)</span>

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"LCFS Conversion Factors and Benchmarks:"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*45)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Energy Conversion Factors (MJ per unit):"</span>)
<span style="color: #0000FF; font-weight: bold;">for</span> fuel, factor <span style="color: #0000FF; font-weight: bold;">in</span> ENERGY_CONVERSIONS.items():
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  </span>{fuel}<span style="color: #008000;">: </span>{factor}<span style="color: #008000;"> MJ/gallon"</span>)

<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">2025 Regulatory Benchmarks (gCO2e/MJ):"</span>)
<span style="color: #0000FF; font-weight: bold;">for</span> fuel, benchmark <span style="color: #0000FF; font-weight: bold;">in</span> REGULATORY_BENCHMARKS_2025.items():
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  </span>{fuel}<span style="color: #008000;">: </span>{benchmark}<span style="color: #008000;">"</span>)
</pre>
</div>

<pre class="example" id="org9411c9d">
LCFS Conversion Factors and Benchmarks:
=============================================
Energy Conversion Factors (MJ per unit):
  renewable_diesel: 138.7 MJ/gallon
  gasoline: 121.3 MJ/gallon
  diesel: 138.7 MJ/gallon
  ethanol: 84.5 MJ/gallon
  hydrogen: 142.0 MJ/gallon

2025 Regulatory Benchmarks (gCO2e/MJ):
  gasoline: 95.61
  diesel: 95.61
  jet_fuel: 88.76
</pre>
</div>
</div>
<div id="outline-container-org88f9632" class="outline-3">
<h3 id="org88f9632"><span class="section-number-3">7.2.</span> Credit Calculation Functions</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF; font-weight: bold;">def</span> <span style="color: #006699;">convert_to_mj</span>(volume, volume_unit, fuel_type):
    <span style="color: #036A07;">"""Convert fuel volume to megajoules"""</span>
    <span style="color: #0000FF; font-weight: bold;">if</span> volume_unit == <span style="color: #008000;">'gallons'</span>:
        <span style="color: #0000FF; font-weight: bold;">return</span> volume * ENERGY_CONVERSIONS.get(fuel_type, 138.7)
    <span style="color: #0000FF; font-weight: bold;">elif</span> volume_unit == <span style="color: #008000;">'liters'</span>:
        <span style="color: #0000FF; font-weight: bold;">return</span> volume * ENERGY_CONVERSIONS.get(fuel_type, 138.7) / 3.78541
    <span style="color: #0000FF; font-weight: bold;">else</span>:
        <span style="color: #0000FF; font-weight: bold;">raise</span> <span style="color: #6434A3;">ValueError</span>(f<span style="color: #008000;">"Unsupported volume unit: </span>{volume_unit}<span style="color: #008000;">"</span>)

<span style="color: #0000FF; font-weight: bold;">def</span> <span style="color: #006699;">calculate_lcfs_credits</span>(transaction, pathway, benchmark_ci):
    <span style="color: #036A07;">"""Calculate LCFS credits for a single transaction"""</span>
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Convert fuel volume to energy units (MJ)</span>
    <span style="color: #BA36A5;">fuel_volume_mj</span> = convert_to_mj(
        transaction[<span style="color: #008000;">'fuelVolume'</span>],
        transaction[<span style="color: #008000;">'fuelVolumeUnit'</span>], 
        transaction[<span style="color: #008000;">'fuelCategory'</span>]
    )
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Calculate carbon intensity difference</span>
    <span style="color: #BA36A5;">ci_difference</span> = benchmark_ci - pathway[<span style="color: #008000;">'carbonIntensity'</span>]
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Apply Energy Economy Ratio</span>
    <span style="color: #BA36A5;">eer</span> = pathway[<span style="color: #008000;">'energyEconomyRatio'</span>]
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Calculate credits (positive) or deficits (negative)</span>
    <span style="color: #BA36A5;">credit_calculation</span> = ci_difference * fuel_volume_mj * eer
    
    <span style="color: #0000FF; font-weight: bold;">return</span> {
        <span style="color: #008000;">'transaction_id'</span>: transaction[<span style="color: #008000;">'transactionId'</span>],
        <span style="color: #008000;">'fuel_volume_mj'</span>: fuel_volume_mj,
        <span style="color: #008000;">'pathway_ci'</span>: pathway[<span style="color: #008000;">'carbonIntensity'</span>],
        <span style="color: #008000;">'benchmark_ci'</span>: benchmark_ci,
        <span style="color: #008000;">'ci_difference'</span>: ci_difference,
        <span style="color: #008000;">'eer'</span>: eer,
        <span style="color: #008000;">'credits'</span>: <span style="color: #006FE0;">max</span>(credit_calculation, 0),
        <span style="color: #008000;">'deficits'</span>: <span style="color: #006FE0;">abs</span>(<span style="color: #006FE0;">min</span>(credit_calculation, 0)),
        <span style="color: #008000;">'net_credits'</span>: credit_calculation
    }

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"LCFS Credit Calculation Functions Loaded &#10003;"</span>)
</pre>
</div>

<pre class="example">
LCFS Credit Calculation Functions Loaded ✓
</pre>
</div>
</div>
