programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** Q1 2025 Credit Calculations

#+begin_src python :session lcfs-analysis
# Calculate LCFS credits for Q1 2025 using session data

# Benchmark for renewable diesel (using gasoline benchmark)
benchmark_ci = REGULATORY_BENCHMARKS_2025['gasoline']

print("Q1 2025 LCFS Credit Calculations:")
print("="*40)

total_credits = 0
total_deficits = 0
total_fuel_mj = 0
calculations = []

for txn in transactions_data:
    pathway = pathway_lookup[txn['lcfsPathwayId']]
    result = calculate_lcfs_credits(txn, pathway, benchmark_ci)
    calculations.append(result)
    
    total_credits += result['credits']
    total_deficits += result['deficits']
    total_fuel_mj += result['fuel_volume_mj']
    
    print(f"Transaction {txn['transactionId']}:")
    print(f"  Volume: {txn['fuelVolume']:,} gallons ({result['fuel_volume_mj']:,.0f} MJ)")
    print(f"  Pathway: {txn['lcfsPathwayId']}")
    print(f"  CI: {result['pathway_ci']} gCO2e/MJ")
    print(f"  CI Difference: {result['ci_difference']:.2f} gCO2e/MJ")
    print(f"  Credits Generated: {result['credits']:,.0f}")
    print()

print("="*40)
print("Q1 2025 Summary:")
print(f"Total Fuel Volume: {sum(t['fuelVolume'] for t in transactions_data):,} gallons")
print(f"Total Energy: {total_fuel_mj:,.0f} MJ")
print(f"Total Credits Generated: {total_credits:,.0f}")
print(f"Total Deficits: {total_deficits:,.0f}")
print(f"Net Position: {total_credits - total_deficits:,.0f} credits")

# Portfolio-weighted CI
portfolio_ci = sum(r['pathway_ci'] * r['fuel_volume_mj'] for r in calculations) / total_fuel_mj
print(f"Portfolio-Weighted CI: {portfolio_ci:.2f} gCO2e/MJ")
print(f"CI Improvement vs Benchmark: {benchmark_ci - portfolio_ci:.2f} gCO2e/MJ")
#+end_src

#+RESULTS:
#+begin_example
Q1 2025 LCFS Credit Calculations:
========================================
Transaction TXN-2025-Q1-001:
  Volume: 875,000.0 gallons (121,362,500 MJ)
  Pathway: CA-RD-2025-LMR-001
  CI: 18.7 gCO2e/MJ
  CI Difference: 76.91 gCO2e/MJ
  Credits Generated: 9,333,989,875

Transaction TXN-2025-Q1-002:
  Volume: 1,250,000.0 gallons (173,375,000 MJ)
  Pathway: CA-RD-2025-AGR-001
  CI: 16.2 gCO2e/MJ
  CI Difference: 79.41 gCO2e/MJ
  Credits Generated: 13,767,708,750

Transaction TXN-2025-Q1-003:
  Volume: 650,000.0 gallons (90,155,000 MJ)
  Pathway: CA-RD-2025-GRW-001
  CI: 14.5 gCO2e/MJ
  CI Difference: 81.11 gCO2e/MJ
  Credits Generated: 7,312,472,050

Transaction TXN-2025-Q1-004:
  Volume: 425,000.0 gallons (58,947,500 MJ)
  Pathway: CA-RD-2025-FHR-001
  CI: 21.3 gCO2e/MJ
  CI Difference: 74.31 gCO2e/MJ
  Credits Generated: 4,380,388,725

Transaction TXN-2025-Q1-005:
  Volume: 1,100,000.0 gallons (152,570,000 MJ)
  Pathway: CA-RD-2025-AGR-001
  CI: 16.2 gCO2e/MJ
  CI Difference: 79.41 gCO2e/MJ
  Credits Generated: 12,115,583,700

Transaction TXN-2025-Q1-006:
  Volume: 775,000.0 gallons (107,492,500 MJ)
  Pathway: CA-RD-2025-LMR-001
  CI: 18.7 gCO2e/MJ
  CI Difference: 76.91 gCO2e/MJ
  Credits Generated: 8,267,248,175

========================================
Q1 2025 Summary:
Total Fuel Volume: 5,075,000.0 gallons
Total Energy: 703,902,500 MJ
Total Credits Generated: 55,177,391,275
Total Deficits: 0
Net Position: 55,177,391,275 credits
Portfolio-Weighted CI: 17.22 gCO2e/MJ
CI Improvement vs Benchmark: 78.39 gCO2e/MJ
#+end_example

* Energy and Carbon Data Entities

Detailed carbon intensity data supporting the LCFS pathway certifications.

** EnergyCarbonData Entities

#+begin_src json :tangle energy_carbon_data.json
[
  {
    "energyCarbonDataId": "CI-2025-LMR-001",
    "dataCategory": "carbon_intensity",
    "value": 18.7,
    "unit": "gCO2e/MJ",
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1", 
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-10",
    "associatedPathway": "CA-RD-2025-LMR-001",
    "lcaBreakdown": {
      "feedstock": 4.0,
      "transport": 1.2,
      "processing": 12.8,
      "distribution": 0.7
    }
  },
  {
    "energyCarbonDataId": "CI-2025-AGR-001", 
    "dataCategory": "carbon_intensity",
    "value": 16.2,
    "unit": "gCO2e/MJ",
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1",
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-15",
    "associatedPathway": "CA-RD-2025-AGR-001",
    "lcaBreakdown": {
      "feedstock": 3.6,
      "transport": 2.1, 
      "processing": 10.1,
      "distribution": 0.4
    }
  },
  {
    "energyCarbonDataId": "CI-2025-GRW-001",
    "dataCategory": "carbon_intensity", 
    "value": 14.5,
    "unit": "gCO2e/MJ",
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1",
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-20",
    "associatedPathway": "CA-RD-2025-GRW-001",
    "lcaBreakdown": {
      "feedstock": 2.6,
      "transport": 1.8,
      "processing": 9.8,
      "distribution": 0.3
    }
  },
  {
    "energyCarbonDataId": "CI-2025-FHR-001",
    "dataCategory": "carbon_intensity",
    "value": 21.3,
    "unit": "gCO2e/MJ", 
    "source": "Third-party verification by Environmental Resources Management",
    "measurementMethod": "CA-GREET3.0",
    "lcfsPathwayType": "Tier_1",
    "energyEconomyRatio": 1.0,
    "lifeCycleStage": "production",
    "regulatoryBenchmark": 95.61,
    "verificationDate": "2025-01-05",
    "associatedPathway": "CA-RD-2025-FHR-001",
    "lcaBreakdown": {
      "feedstock": 5.6,
      "transport": 2.4,
      "processing": 12.8,
      "distribution": 0.5
    }
  }
]
#+end_src

