programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-orgcaf7b7d" class="outline-3">
<h3 id="orgcaf7b7d"><span class="section-number-3">7.3.</span> Q1 2025 Credit Calculations</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Calculate LCFS credits for Q1 2025 using session data</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Benchmark for renewable diesel (using gasoline benchmark)</span>
<span style="color: #BA36A5;">benchmark_ci</span> = REGULATORY_BENCHMARKS_2025[<span style="color: #008000;">'gasoline'</span>]

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Q1 2025 LCFS Credit Calculations:"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*40)

<span style="color: #BA36A5;">total_credits</span> = 0
<span style="color: #BA36A5;">total_deficits</span> = 0
<span style="color: #BA36A5;">total_fuel_mj</span> = 0
<span style="color: #BA36A5;">calculations</span> = []

<span style="color: #0000FF; font-weight: bold;">for</span> txn <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data:
    <span style="color: #BA36A5;">pathway</span> = pathway_lookup[txn[<span style="color: #008000;">'lcfsPathwayId'</span>]]
    <span style="color: #BA36A5;">result</span> = calculate_lcfs_credits(txn, pathway, benchmark_ci)
    calculations.append(result)
    
    <span style="color: #BA36A5;">total_credits</span> += result[<span style="color: #008000;">'credits'</span>]
    <span style="color: #BA36A5;">total_deficits</span> += result[<span style="color: #008000;">'deficits'</span>]
    <span style="color: #BA36A5;">total_fuel_mj</span> += result[<span style="color: #008000;">'fuel_volume_mj'</span>]
    
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Transaction </span>{txn['transactionId']}<span style="color: #008000;">:"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Volume: </span>{txn['fuelVolume']:,}<span style="color: #008000;"> gallons (</span>{result['fuel_volume_mj']:,.0f}<span style="color: #008000;"> MJ)"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Pathway: </span>{txn['lcfsPathwayId']}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  CI: </span>{result['pathway_ci']}<span style="color: #008000;"> gCO2e/MJ"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  CI Difference: </span>{result['ci_difference']:.2f}<span style="color: #008000;"> gCO2e/MJ"</span>)
    <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"  Credits Generated: </span>{result['<span style="color: #D0372D;">credits</span>']:,.0f}<span style="color: #008000;">"</span>)
    <span style="color: #006FE0;">print</span>()

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*40)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Q1 2025 Summary:"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Total Fuel Volume: </span>{<span style="color: #006FE0;">sum</span>(t['fuelVolume'] <span style="color: #0000FF; font-weight: bold;">for</span> t <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data):,}<span style="color: #008000;"> gallons"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Total Energy: </span>{total_fuel_mj:,.0f}<span style="color: #008000;"> MJ"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Total Credits Generated: </span>{total_credits:,.0f}<span style="color: #008000;">"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Total Deficits: </span>{total_deficits:,.0f}<span style="color: #008000;">"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Net Position: </span>{total_credits - total_deficits:,.0f}<span style="color: #008000;"> credits"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Portfolio-weighted CI</span>
<span style="color: #BA36A5;">portfolio_ci</span> = <span style="color: #006FE0;">sum</span>(r[<span style="color: #008000;">'pathway_ci'</span>] * r[<span style="color: #008000;">'fuel_volume_mj'</span>] <span style="color: #0000FF; font-weight: bold;">for</span> r <span style="color: #0000FF; font-weight: bold;">in</span> calculations) / total_fuel_mj
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"Portfolio-Weighted CI: </span>{portfolio_ci:.2f}<span style="color: #008000;"> gCO2e/MJ"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"CI Improvement vs Benchmark: </span>{benchmark_ci - portfolio_ci:.2f}<span style="color: #008000;"> gCO2e/MJ"</span>)
</pre>
</div>

<pre class="example" id="org01ac468">
Q1 2025 LCFS Credit Calculations:
========================================
Transaction TXN-2025-Q1-001:
  Volume: 875,000.0 gallons (121,362,500 MJ)
  Pathway: CA-RD-2025-LMR-001
  CI: 18.7 gCO2e/MJ
  CI Difference: 76.91 gCO2e/MJ
  Credits Generated: 9,333,989,875

Transaction TXN-2025-Q1-002:
  Volume: 1,250,000.0 gallons (173,375,000 MJ)
  Pathway: CA-RD-2025-AGR-001
  CI: 16.2 gCO2e/MJ
  CI Difference: 79.41 gCO2e/MJ
  Credits Generated: 13,767,708,750

Transaction TXN-2025-Q1-003:
  Volume: 650,000.0 gallons (90,155,000 MJ)
  Pathway: CA-RD-2025-GRW-001
  CI: 14.5 gCO2e/MJ
  CI Difference: 81.11 gCO2e/MJ
  Credits Generated: 7,312,472,050

Transaction TXN-2025-Q1-004:
  Volume: 425,000.0 gallons (58,947,500 MJ)
  Pathway: CA-RD-2025-FHR-001
  CI: 21.3 gCO2e/MJ
  CI Difference: 74.31 gCO2e/MJ
  Credits Generated: 4,380,388,725

Transaction TXN-2025-Q1-005:
  Volume: 1,100,000.0 gallons (152,570,000 MJ)
  Pathway: CA-RD-2025-AGR-001
  CI: 16.2 gCO2e/MJ
  CI Difference: 79.41 gCO2e/MJ
  Credits Generated: 12,115,583,700

Transaction TXN-2025-Q1-006:
  Volume: 775,000.0 gallons (107,492,500 MJ)
  Pathway: CA-RD-2025-LMR-001
  CI: 18.7 gCO2e/MJ
  CI Difference: 76.91 gCO2e/MJ
  Credits Generated: 8,267,248,175

========================================
Q1 2025 Summary:
Total Fuel Volume: 5,075,000.0 gallons
Total Energy: 703,902,500 MJ
Total Credits Generated: 55,177,391,275
Total Deficits: 0
Net Position: 55,177,391,275 credits
Portfolio-Weighted CI: 17.22 gCO2e/MJ
CI Improvement vs Benchmark: 78.39 gCO2e/MJ
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfd868fb" class="outline-2">
<h2 id="orgfd868fb"><span class="section-number-2">8.</span> Energy and Carbon Data Entities</h2>
<div class="outline-text-2" id="text-8">
<p>
Detailed carbon intensity data supporting the LCFS pathway certifications.
</p>
</div>
