programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** Carbon Intensity Analysis

#+begin_src python :session lcfs-analysis
# Analyze carbon intensity data from session

print("Carbon Intensity Lifecycle Analysis:")
print("="*40)

feedstock_types = []
ci_values = []
lca_data = []

for data in carbon_data_list:
    pathway_id = data['associatedPathway']
    ci = data['value']
    lca = data['lcaBreakdown']
    
    # Extract feedstock type from pathway ID
    if 'LMR' in pathway_id:
        feedstock = 'Lumber Mill Residual'
    elif 'AGR' in pathway_id:
        feedstock = 'Agricultural Residue'
    elif 'GRW' in pathway_id:
        feedstock = 'Green Waste'
    elif 'FHR' in pathway_id:
        feedstock = 'Forest Harvest Residual'
    
    feedstock_types.append(feedstock)
    ci_values.append(ci)
    lca_data.append(lca)
    
    print(f"{feedstock}:")
    print(f"  Total CI: {ci} gCO2e/MJ")
    print(f"  Feedstock: {lca['feedstock']} gCO2e/MJ")
    print(f"  Transport: {lca['transport']} gCO2e/MJ") 
    print(f"  Processing: {lca['processing']} gCO2e/MJ")
    print(f"  Distribution: {lca['distribution']} gCO2e/MJ")
    print()

print("CI Ranking (Lowest to Highest):")
ci_ranking = sorted(zip(feedstock_types, ci_values), key=lambda x: x[1])
for i, (feedstock, ci) in enumerate(ci_ranking, 1):
    print(f"  {i}. {feedstock}: {ci} gCO2e/MJ")
#+end_src

#+RESULTS:
#+begin_example
Carbon Intensity Lifecycle Analysis:
========================================
Lumber Mill Residual:
  Total CI: 18.7 gCO2e/MJ
  Feedstock: 4.0 gCO2e/MJ
  Transport: 1.2 gCO2e/MJ
  Processing: 12.8 gCO2e/MJ
  Distribution: 0.7 gCO2e/MJ

Agricultural Residue:
  Total CI: 16.2 gCO2e/MJ
  Feedstock: 3.6 gCO2e/MJ
  Transport: 2.1 gCO2e/MJ
  Processing: 10.1 gCO2e/MJ
  Distribution: 0.4 gCO2e/MJ

Green Waste:
  Total CI: 14.5 gCO2e/MJ
  Feedstock: 2.6 gCO2e/MJ
  Transport: 1.8 gCO2e/MJ
  Processing: 9.8 gCO2e/MJ
  Distribution: 0.3 gCO2e/MJ

Forest Harvest Residual:
  Total CI: 21.3 gCO2e/MJ
  Feedstock: 5.6 gCO2e/MJ
  Transport: 2.4 gCO2e/MJ
  Processing: 12.8 gCO2e/MJ
  Distribution: 0.5 gCO2e/MJ

CI Ranking (Lowest to Highest):
  1. Green Waste: 14.5 gCO2e/MJ
  2. Agricultural Residue: 16.2 gCO2e/MJ
  3. Lumber Mill Residual: 18.7 gCO2e/MJ
  4. Forest Harvest Residual: 21.3 gCO2e/MJ
#+end_example

* LCFS Quarterly Report Generation

Generate the complete quarterly report for submission to CARB LRT-CBTS system.

