programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** LCFSReporting Entity

#+begin_src python :session lcfs-analysis
from datetime import datetime

# Generate LCFSReporting entity using session data

# Calculate quarterly totals
total_fuel_gallons = sum(t['fuelVolume'] for t in transactions_data)
total_fuel_mj = 0
total_credits = 0
total_deficits = 0

benchmark_ci = REGULATORY_BENCHMARKS_2025['gasoline']

for txn in transactions_data:
    pathway = pathway_lookup[txn['lcfsPathwayId']]
    result = calculate_lcfs_credits(txn, pathway, benchmark_ci)
    
    total_fuel_mj += result['fuel_volume_mj']
    total_credits += result['credits'] 
    total_deficits += result['deficits']

net_position = total_credits - total_deficits
compliance_status = "compliant" if net_position >= 0 else "deficit"

# Generate LCFSReporting entity
lcfs_reporting = {
    "reportingId": "LCFS-RPT-2025-Q1-003",
    "regulatedEntityId": "pacific-renewable-fuels-001",
    "reportingPeriod": "2025-Q1",
    "totalFuelVolume": total_fuel_mj,  # Reported in MJ
    "totalCreditsGenerated": total_credits,
    "totalDeficitsIncurred": total_deficits,
    "netPosition": net_position,
    "complianceStatus": compliance_status,
    "submissionDate": "2025-04-15T14:30:00Z",
    "verificationDate": "2025-04-10T10:00:00Z",
    "verifier": "Environmental Resources Management",
    "quarterlyStatistics": {
        "totalTransactions": len(transactions_data),
        "uniquePathways": len(set(t['lcfsPathwayId'] for t in transactions_data)),
        "portfolioWeightedCI": sum(pathway_lookup[t['lcfsPathwayId']]['carbonIntensity'] * 
                                calculate_lcfs_credits(t, pathway_lookup[t['lcfsPathwayId']], benchmark_ci)['fuel_volume_mj'] 
                                for t in transactions_data) / total_fuel_mj
    }
}

print("LCFSReporting Entity Generated:")
print(json.dumps(lcfs_reporting, indent=2))
#+end_src

#+RESULTS:
#+begin_example
LCFSReporting Entity Generated:
{
  "reportingId": "LCFS-RPT-2025-Q1-003",
  "regulatedEntityId": "pacific-renewable-fuels-001",
  "reportingPeriod": "2025-Q1",
  "totalFuelVolume": 703902500.0,
  "totalCreditsGenerated": 55177391275.0,
  "totalDeficitsIncurred": 0,
  "netPosition": 55177391275.0,
  "complianceStatus": "compliant",
  "submissionDate": "2025-04-15T14:30:00Z",
  "verificationDate": "2025-04-10T10:00:00Z",
  "verifier": "Environmental Resources Management",
  "quarterlyStatistics": {
    "totalTransactions": 6,
    "uniquePathways": 4,
    "portfolioWeightedCI": 17.22216748768473
  }
}
#+end_example

