programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-orge9204ad" class="outline-3">
<h3 id="orge9204ad"><span class="section-number-3">9.1.</span> LCFSReporting Entity</h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF; font-weight: bold;">from</span> datetime <span style="color: #0000FF; font-weight: bold;">import</span> datetime

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate LCFSReporting entity using session data</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Calculate quarterly totals</span>
<span style="color: #BA36A5;">total_fuel_gallons</span> = <span style="color: #006FE0;">sum</span>(t[<span style="color: #008000;">'fuelVolume'</span>] <span style="color: #0000FF; font-weight: bold;">for</span> t <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data)
<span style="color: #BA36A5;">total_fuel_mj</span> = 0
<span style="color: #BA36A5;">total_credits</span> = 0
<span style="color: #BA36A5;">total_deficits</span> = 0

<span style="color: #BA36A5;">benchmark_ci</span> = REGULATORY_BENCHMARKS_2025[<span style="color: #008000;">'gasoline'</span>]

<span style="color: #0000FF; font-weight: bold;">for</span> txn <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data:
    <span style="color: #BA36A5;">pathway</span> = pathway_lookup[txn[<span style="color: #008000;">'lcfsPathwayId'</span>]]
    <span style="color: #BA36A5;">result</span> = calculate_lcfs_credits(txn, pathway, benchmark_ci)
    
    <span style="color: #BA36A5;">total_fuel_mj</span> += result[<span style="color: #008000;">'fuel_volume_mj'</span>]
    <span style="color: #BA36A5;">total_credits</span> += result[<span style="color: #008000;">'credits'</span>] 
    <span style="color: #BA36A5;">total_deficits</span> += result[<span style="color: #008000;">'deficits'</span>]

<span style="color: #BA36A5;">net_position</span> = total_credits - total_deficits
<span style="color: #BA36A5;">compliance_status</span> = <span style="color: #008000;">"compliant"</span> <span style="color: #0000FF; font-weight: bold;">if</span> net_position &gt;= 0 <span style="color: #0000FF; font-weight: bold;">else</span> <span style="color: #008000;">"deficit"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate LCFSReporting entity</span>
<span style="color: #BA36A5;">lcfs_reporting</span> = {
    <span style="color: #008000;">"reportingId"</span>: <span style="color: #008000;">"LCFS-RPT-2025-Q1-003"</span>,
    <span style="color: #008000;">"regulatedEntityId"</span>: <span style="color: #008000;">"pacific-renewable-fuels-001"</span>,
    <span style="color: #008000;">"reportingPeriod"</span>: <span style="color: #008000;">"2025-Q1"</span>,
    <span style="color: #008000;">"totalFuelVolume"</span>: total_fuel_mj,  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Reported in MJ</span>
    <span style="color: #008000;">"totalCreditsGenerated"</span>: total_credits,
    <span style="color: #008000;">"totalDeficitsIncurred"</span>: total_deficits,
    <span style="color: #008000;">"netPosition"</span>: net_position,
    <span style="color: #008000;">"complianceStatus"</span>: compliance_status,
    <span style="color: #008000;">"submissionDate"</span>: <span style="color: #008000;">"2025-04-15T14:30:00Z"</span>,
    <span style="color: #008000;">"verificationDate"</span>: <span style="color: #008000;">"2025-04-10T10:00:00Z"</span>,
    <span style="color: #008000;">"verifier"</span>: <span style="color: #008000;">"Environmental Resources Management"</span>,
    <span style="color: #008000;">"quarterlyStatistics"</span>: {
        <span style="color: #008000;">"totalTransactions"</span>: <span style="color: #006FE0;">len</span>(transactions_data),
        <span style="color: #008000;">"uniquePathways"</span>: <span style="color: #006FE0;">len</span>(<span style="color: #006FE0;">set</span>(t[<span style="color: #008000;">'lcfsPathwayId'</span>] <span style="color: #0000FF; font-weight: bold;">for</span> t <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data)),
        <span style="color: #008000;">"portfolioWeightedCI"</span>: <span style="color: #006FE0;">sum</span>(pathway_lookup[t[<span style="color: #008000;">'lcfsPathwayId'</span>]][<span style="color: #008000;">'carbonIntensity'</span>] * 
                                calculate_lcfs_credits(t, pathway_lookup[t[<span style="color: #008000;">'lcfsPathwayId'</span>]], benchmark_ci)[<span style="color: #008000;">'fuel_volume_mj'</span>] 
                                <span style="color: #0000FF; font-weight: bold;">for</span> t <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data) / total_fuel_mj
    }
}

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"LCFSReporting Entity Generated:"</span>)
<span style="color: #006FE0;">print</span>(json.dumps(lcfs_reporting, indent=2))
</pre>
</div>

<pre class="example" id="org04a67d2">
LCFSReporting Entity Generated:
{
  "reportingId": "LCFS-RPT-2025-Q1-003",
  "regulatedEntityId": "pacific-renewable-fuels-001",
  "reportingPeriod": "2025-Q1",
  "totalFuelVolume": 703902500.0,
  "totalCreditsGenerated": 55177391275.0,
  "totalDeficitsIncurred": 0,
  "netPosition": 55177391275.0,
  "complianceStatus": "compliant",
  "submissionDate": "2025-04-15T14:30:00Z",
  "verificationDate": "2025-04-10T10:00:00Z",
  "verifier": "Environmental Resources Management",
  "quarterlyStatistics": {
    "totalTransactions": 6,
    "uniquePathways": 4,
    "portfolioWeightedCI": 17.22216748768473
  }
}
</pre>
</div>
</div>
