programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** CARB LRT-CBTS Report Format

#+begin_src python :session lcfs-analysis
# Generate complete CARB submission report
carb_report = {
    "lcfs_quarterly_report": {
        "header": {
            "regulated_entity_id": "LCFS-REG-2025-003",
            "organization_name": "Pacific Renewable Fuels Corp",
            "reporting_period": "2025-Q1",
            "submission_date": "2025-04-15T14:30:00Z",
            "report_version": "1.0",
            "contact_info": {
                "name": "Sarah Chen",
                "title": "LCFS Compliance Manager", 
                "email": "s.chen@pacificrenewable.com",
                "phone": "+1-209-555-0157"
            }
        },
        "summary": {
            "total_fuel_volume_gallons": total_fuel_gallons,
            "total_fuel_volume_mj": total_fuel_mj,
            "total_credits_generated": total_credits,
            "total_deficits_incurred": total_deficits,
            "net_position": net_position,
            "compliance_status": compliance_status,
            "portfolio_weighted_ci": lcfs_reporting["quarterlyStatistics"]["portfolioWeightedCI"],
            "ci_improvement_vs_benchmark": benchmark_ci - lcfs_reporting["quarterlyStatistics"]["portfolioWeightedCI"]
        },
        "transactions": [],
        "pathways_used": [],
        "verification": {
            "verifier_name": "Environmental Resources Management",
            "verification_date": "2025-04-10T10:00:00Z",
            "verification_opinion": "Unqualified",
            "verification_scope": "Complete Q1 2025 renewable diesel production and sales"
        }
    }
}

# Add transaction details
for txn in transactions_data:
    pathway = pathway_lookup[txn['lcfsPathwayId']]
    calc_result = calculate_lcfs_credits(txn, pathway, benchmark_ci)
    
    carb_report["lcfs_quarterly_report"]["transactions"].append({
        "transaction_id": txn['transactionId'],
        "transaction_date": txn['transactionDate'],
        "fuel_type": txn['fuelCategory'],
        "fuel_volume_gallons": txn['fuelVolume'],
        "fuel_volume_mj": calc_result['fuel_volume_mj'],
        "pathway_id": txn['lcfsPathwayId'],
        "carbon_intensity": pathway['carbonIntensity'],
        "energy_economy_ratio": pathway['energyEconomyRatio'],
        "credits_generated": calc_result['credits'],
        "customer_organization": txn['customerOrganizationId'],
        "delivery_location": txn['deliveryLocation']
    })

# Add pathway summary
pathway_summary = {}
for txn in transactions_data:
    pathway_id = txn['lcfsPathwayId']
    if pathway_id not in pathway_summary:
        pathway = pathway_lookup[pathway_id]
        pathway_summary[pathway_id] = {
            "pathway_id": pathway_id,
            "pathway_type": pathway['pathwayType'],
            "feedstock_category": pathway['feedstockCategory'],
            "fuel_product": pathway['fuelProduct'],
            "carbon_intensity": pathway['carbonIntensity'],
            "certification_date": pathway['certificationDate'],
            "verification_status": pathway['verificationStatus'],
            "total_volume_gallons": 0,
            "total_credits": 0
        }
    
    calc_result = calculate_lcfs_credits(txn, pathway_lookup[pathway_id], benchmark_ci)
    pathway_summary[pathway_id]["total_volume_gallons"] += txn['fuelVolume']
    pathway_summary[pathway_id]["total_credits"] += calc_result['credits']

carb_report["lcfs_quarterly_report"]["pathways_used"] = list(pathway_summary.values())

print("CARB LRT-CBTS Quarterly Report:")
print("="*35)
print(json.dumps(carb_report, indent=2))
#+end_src

#+RESULTS:
#+begin_example
CARB LRT-CBTS Quarterly Report:
===================================
{
  "lcfs_quarterly_report": {
    "header": {
      "regulated_entity_id": "LCFS-REG-2025-003",
      "organization_name": "Pacific Renewable Fuels Corp",
      "reporting_period": "2025-Q1",
      "submission_date": "2025-04-15T14:30:00Z",
      "report_version": "1.0",
      "contact_info": {
        "name": "Sarah Chen",
        "title": "LCFS Compliance Manager",
        "email": "s.chen@pacificrenewable.com",
        "phone": "+1-209-555-0157"
      }
    },
    "summary": {
      "total_fuel_volume_gallons": 5075000.0,
      "total_fuel_volume_mj": 703902500.0,
      "total_credits_generated": 55177391275.0,
      "total_deficits_incurred": 0,
      "net_position": 55177391275.0,
      "compliance_status": "compliant",
      "portfolio_weighted_ci": 17.22216748768473,
      "ci_improvement_vs_benchmark": 78.38783251231527
    },
    "transactions": [
      {
        "transaction_id": "TXN-2025-Q1-001",
        "transaction_date": "2025-01-15",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 875000.0,
        "fuel_volume_mj": 121362499.99999999,
        "pathway_id": "CA-RD-2025-LMR-001",
        "carbon_intensity": 18.7,
        "energy_economy_ratio": 1.0,
        "credits_generated": 9333989874.999998,
        "customer_organization": "ca-fuel-distributor-001",
        "delivery_location": {
          "city": "Oakland",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-002",
        "transaction_date": "2025-01-28",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 1250000.0,
        "fuel_volume_mj": 173375000.0,
        "pathway_id": "CA-RD-2025-AGR-001",
        "carbon_intensity": 16.2,
        "energy_economy_ratio": 1.0,
        "credits_generated": 13767708750.0,
        "customer_organization": "ca-fuel-distributor-002",
        "delivery_location": {
          "city": "Fresno",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-003",
        "transaction_date": "2025-02-12",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 650000.0,
        "fuel_volume_mj": 90155000.0,
        "pathway_id": "CA-RD-2025-GRW-001",
        "carbon_intensity": 14.5,
        "energy_economy_ratio": 1.0,
        "credits_generated": 7312472050.0,
        "customer_organization": "ca-fuel-distributor-003",
        "delivery_location": {
          "city": "San Jose",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-004",
        "transaction_date": "2025-02-25",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 425000.0,
        "fuel_volume_mj": 58947499.99999999,
        "pathway_id": "CA-RD-2025-FHR-001",
        "carbon_intensity": 21.3,
        "energy_economy_ratio": 1.0,
        "credits_generated": 4380388725.0,
        "customer_organization": "ca-fuel-distributor-001",
        "delivery_location": {
          "city": "Sacramento",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-005",
        "transaction_date": "2025-03-10",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 1100000.0,
        "fuel_volume_mj": 152570000.0,
        "pathway_id": "CA-RD-2025-AGR-001",
        "carbon_intensity": 16.2,
        "energy_economy_ratio": 1.0,
        "credits_generated": 12115583700.0,
        "customer_organization": "ca-fuel-distributor-002",
        "delivery_location": {
          "city": "Bakersfield",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-006",
        "transaction_date": "2025-03-22",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 775000.0,
        "fuel_volume_mj": 107492499.99999999,
        "pathway_id": "CA-RD-2025-LMR-001",
        "carbon_intensity": 18.7,
        "energy_economy_ratio": 1.0,
        "credits_generated": 8267248174.999998,
        "customer_organization": "ca-fuel-distributor-004",
        "delivery_location": {
          "city": "Los Angeles",
          "state": "CA"
        }
      }
    ],
    "pathways_used": [
      {
        "pathway_id": "CA-RD-2025-LMR-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "lumber_mill_residual",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 18.7,
        "certification_date": "2025-01-15",
        "verification_status": "active",
        "total_volume_gallons": 1650000.0,
        "total_credits": 17601238049.999996
      },
      {
        "pathway_id": "CA-RD-2025-AGR-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "agricultural_residue",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 16.2,
        "certification_date": "2025-01-20",
        "verification_status": "active",
        "total_volume_gallons": 2350000.0,
        "total_credits": 25883292450.0
      },
      {
        "pathway_id": "CA-RD-2025-GRW-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "municipal_green_waste",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 14.5,
        "certification_date": "2025-02-01",
        "verification_status": "active",
        "total_volume_gallons": 650000.0,
        "total_credits": 7312472050.0
      },
      {
        "pathway_id": "CA-RD-2025-FHR-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "forest_harvest_residual",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 21.3,
        "certification_date": "2025-01-10",
        "verification_status": "active",
        "total_volume_gallons": 425000.0,
        "total_credits": 4380388725.0
      }
    ],
    "verification": {
      "verifier_name": "Environmental Resources Management",
      "verification_date": "2025-04-10T10:00:00Z",
      "verification_opinion": "Unqualified",
      "verification_scope": "Complete Q1 2025 renewable diesel production and sales"
    }
  }
}
#+end_example

