programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org68fcbf4" class="outline-3">
<h3 id="org68fcbf4"><span class="section-number-3">9.2.</span> CARB LRT-CBTS Report Format</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Generate complete CARB submission report</span>
<span style="color: #BA36A5;">carb_report</span> = {
    <span style="color: #008000;">"lcfs_quarterly_report"</span>: {
        <span style="color: #008000;">"header"</span>: {
            <span style="color: #008000;">"regulated_entity_id"</span>: <span style="color: #008000;">"LCFS-REG-2025-003"</span>,
            <span style="color: #008000;">"organization_name"</span>: <span style="color: #008000;">"Pacific Renewable Fuels Corp"</span>,
            <span style="color: #008000;">"reporting_period"</span>: <span style="color: #008000;">"2025-Q1"</span>,
            <span style="color: #008000;">"submission_date"</span>: <span style="color: #008000;">"2025-04-15T14:30:00Z"</span>,
            <span style="color: #008000;">"report_version"</span>: <span style="color: #008000;">"1.0"</span>,
            <span style="color: #008000;">"contact_info"</span>: {
                <span style="color: #008000;">"name"</span>: <span style="color: #008000;">"Sarah Chen"</span>,
                <span style="color: #008000;">"title"</span>: <span style="color: #008000;">"LCFS Compliance Manager"</span>, 
                <span style="color: #008000;">"email"</span>: <span style="color: #008000;">"s.chen@pacificrenewable.com"</span>,
                <span style="color: #008000;">"phone"</span>: <span style="color: #008000;">"+1-209-555-0157"</span>
            }
        },
        <span style="color: #008000;">"summary"</span>: {
            <span style="color: #008000;">"total_fuel_volume_gallons"</span>: total_fuel_gallons,
            <span style="color: #008000;">"total_fuel_volume_mj"</span>: total_fuel_mj,
            <span style="color: #008000;">"total_credits_generated"</span>: total_credits,
            <span style="color: #008000;">"total_deficits_incurred"</span>: total_deficits,
            <span style="color: #008000;">"net_position"</span>: net_position,
            <span style="color: #008000;">"compliance_status"</span>: compliance_status,
            <span style="color: #008000;">"portfolio_weighted_ci"</span>: lcfs_reporting[<span style="color: #008000;">"quarterlyStatistics"</span>][<span style="color: #008000;">"portfolioWeightedCI"</span>],
            <span style="color: #008000;">"ci_improvement_vs_benchmark"</span>: benchmark_ci - lcfs_reporting[<span style="color: #008000;">"quarterlyStatistics"</span>][<span style="color: #008000;">"portfolioWeightedCI"</span>]
        },
        <span style="color: #008000;">"transactions"</span>: [],
        <span style="color: #008000;">"pathways_used"</span>: [],
        <span style="color: #008000;">"verification"</span>: {
            <span style="color: #008000;">"verifier_name"</span>: <span style="color: #008000;">"Environmental Resources Management"</span>,
            <span style="color: #008000;">"verification_date"</span>: <span style="color: #008000;">"2025-04-10T10:00:00Z"</span>,
            <span style="color: #008000;">"verification_opinion"</span>: <span style="color: #008000;">"Unqualified"</span>,
            <span style="color: #008000;">"verification_scope"</span>: <span style="color: #008000;">"Complete Q1 2025 renewable diesel production and sales"</span>
        }
    }
}

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add transaction details</span>
<span style="color: #0000FF; font-weight: bold;">for</span> txn <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data:
    <span style="color: #BA36A5;">pathway</span> = pathway_lookup[txn[<span style="color: #008000;">'lcfsPathwayId'</span>]]
    <span style="color: #BA36A5;">calc_result</span> = calculate_lcfs_credits(txn, pathway, benchmark_ci)
    
    carb_report[<span style="color: #008000;">"lcfs_quarterly_report"</span>][<span style="color: #008000;">"transactions"</span>].append({
        <span style="color: #008000;">"transaction_id"</span>: txn[<span style="color: #008000;">'transactionId'</span>],
        <span style="color: #008000;">"transaction_date"</span>: txn[<span style="color: #008000;">'transactionDate'</span>],
        <span style="color: #008000;">"fuel_type"</span>: txn[<span style="color: #008000;">'fuelCategory'</span>],
        <span style="color: #008000;">"fuel_volume_gallons"</span>: txn[<span style="color: #008000;">'fuelVolume'</span>],
        <span style="color: #008000;">"fuel_volume_mj"</span>: calc_result[<span style="color: #008000;">'fuel_volume_mj'</span>],
        <span style="color: #008000;">"pathway_id"</span>: txn[<span style="color: #008000;">'lcfsPathwayId'</span>],
        <span style="color: #008000;">"carbon_intensity"</span>: pathway[<span style="color: #008000;">'carbonIntensity'</span>],
        <span style="color: #008000;">"energy_economy_ratio"</span>: pathway[<span style="color: #008000;">'energyEconomyRatio'</span>],
        <span style="color: #008000;">"credits_generated"</span>: calc_result[<span style="color: #008000;">'credits'</span>],
        <span style="color: #008000;">"customer_organization"</span>: txn[<span style="color: #008000;">'customerOrganizationId'</span>],
        <span style="color: #008000;">"delivery_location"</span>: txn[<span style="color: #008000;">'deliveryLocation'</span>]
    })

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Add pathway summary</span>
<span style="color: #BA36A5;">pathway_summary</span> = {}
<span style="color: #0000FF; font-weight: bold;">for</span> txn <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data:
    <span style="color: #BA36A5;">pathway_id</span> = txn[<span style="color: #008000;">'lcfsPathwayId'</span>]
    <span style="color: #0000FF; font-weight: bold;">if</span> pathway_id <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> pathway_summary:
        <span style="color: #BA36A5;">pathway</span> = pathway_lookup[pathway_id]
        <span style="color: #BA36A5;">pathway_summary</span>[pathway_id] = {
            <span style="color: #008000;">"pathway_id"</span>: pathway_id,
            <span style="color: #008000;">"pathway_type"</span>: pathway[<span style="color: #008000;">'pathwayType'</span>],
            <span style="color: #008000;">"feedstock_category"</span>: pathway[<span style="color: #008000;">'feedstockCategory'</span>],
            <span style="color: #008000;">"fuel_product"</span>: pathway[<span style="color: #008000;">'fuelProduct'</span>],
            <span style="color: #008000;">"carbon_intensity"</span>: pathway[<span style="color: #008000;">'carbonIntensity'</span>],
            <span style="color: #008000;">"certification_date"</span>: pathway[<span style="color: #008000;">'certificationDate'</span>],
            <span style="color: #008000;">"verification_status"</span>: pathway[<span style="color: #008000;">'verificationStatus'</span>],
            <span style="color: #008000;">"total_volume_gallons"</span>: 0,
            <span style="color: #008000;">"total_credits"</span>: 0
        }
    
    <span style="color: #BA36A5;">calc_result</span> = calculate_lcfs_credits(txn, pathway_lookup[pathway_id], benchmark_ci)
    pathway_summary[pathway_id][<span style="color: #008000;">"total_volume_gallons"</span>] += txn[<span style="color: #008000;">'fuelVolume'</span>]
    pathway_summary[pathway_id][<span style="color: #008000;">"total_credits"</span>] += calc_result[<span style="color: #008000;">'credits'</span>]

carb_report[<span style="color: #008000;">"lcfs_quarterly_report"</span>][<span style="color: #008000;">"pathways_used"</span>] = <span style="color: #006FE0;">list</span>(pathway_summary.values())

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"CARB LRT-CBTS Quarterly Report:"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*35)
<span style="color: #006FE0;">print</span>(json.dumps(carb_report, indent=2))
</pre>
</div>

<pre class="example" id="orged0931b">
CARB LRT-CBTS Quarterly Report:
===================================
{
  "lcfs_quarterly_report": {
    "header": {
      "regulated_entity_id": "LCFS-REG-2025-003",
      "organization_name": "Pacific Renewable Fuels Corp",
      "reporting_period": "2025-Q1",
      "submission_date": "2025-04-15T14:30:00Z",
      "report_version": "1.0",
      "contact_info": {
        "name": "Sarah Chen",
        "title": "LCFS Compliance Manager",
        "email": "s.chen@pacificrenewable.com",
        "phone": "+1-209-555-0157"
      }
    },
    "summary": {
      "total_fuel_volume_gallons": 5075000.0,
      "total_fuel_volume_mj": 703902500.0,
      "total_credits_generated": 55177391275.0,
      "total_deficits_incurred": 0,
      "net_position": 55177391275.0,
      "compliance_status": "compliant",
      "portfolio_weighted_ci": 17.22216748768473,
      "ci_improvement_vs_benchmark": 78.38783251231527
    },
    "transactions": [
      {
        "transaction_id": "TXN-2025-Q1-001",
        "transaction_date": "2025-01-15",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 875000.0,
        "fuel_volume_mj": 121362499.99999999,
        "pathway_id": "CA-RD-2025-LMR-001",
        "carbon_intensity": 18.7,
        "energy_economy_ratio": 1.0,
        "credits_generated": 9333989874.999998,
        "customer_organization": "ca-fuel-distributor-001",
        "delivery_location": {
          "city": "Oakland",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-002",
        "transaction_date": "2025-01-28",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 1250000.0,
        "fuel_volume_mj": 173375000.0,
        "pathway_id": "CA-RD-2025-AGR-001",
        "carbon_intensity": 16.2,
        "energy_economy_ratio": 1.0,
        "credits_generated": 13767708750.0,
        "customer_organization": "ca-fuel-distributor-002",
        "delivery_location": {
          "city": "Fresno",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-003",
        "transaction_date": "2025-02-12",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 650000.0,
        "fuel_volume_mj": 90155000.0,
        "pathway_id": "CA-RD-2025-GRW-001",
        "carbon_intensity": 14.5,
        "energy_economy_ratio": 1.0,
        "credits_generated": 7312472050.0,
        "customer_organization": "ca-fuel-distributor-003",
        "delivery_location": {
          "city": "San Jose",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-004",
        "transaction_date": "2025-02-25",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 425000.0,
        "fuel_volume_mj": 58947499.99999999,
        "pathway_id": "CA-RD-2025-FHR-001",
        "carbon_intensity": 21.3,
        "energy_economy_ratio": 1.0,
        "credits_generated": 4380388725.0,
        "customer_organization": "ca-fuel-distributor-001",
        "delivery_location": {
          "city": "Sacramento",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-005",
        "transaction_date": "2025-03-10",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 1100000.0,
        "fuel_volume_mj": 152570000.0,
        "pathway_id": "CA-RD-2025-AGR-001",
        "carbon_intensity": 16.2,
        "energy_economy_ratio": 1.0,
        "credits_generated": 12115583700.0,
        "customer_organization": "ca-fuel-distributor-002",
        "delivery_location": {
          "city": "Bakersfield",
          "state": "CA"
        }
      },
      {
        "transaction_id": "TXN-2025-Q1-006",
        "transaction_date": "2025-03-22",
        "fuel_type": "renewable_diesel",
        "fuel_volume_gallons": 775000.0,
        "fuel_volume_mj": 107492499.99999999,
        "pathway_id": "CA-RD-2025-LMR-001",
        "carbon_intensity": 18.7,
        "energy_economy_ratio": 1.0,
        "credits_generated": 8267248174.999998,
        "customer_organization": "ca-fuel-distributor-004",
        "delivery_location": {
          "city": "Los Angeles",
          "state": "CA"
        }
      }
    ],
    "pathways_used": [
      {
        "pathway_id": "CA-RD-2025-LMR-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "lumber_mill_residual",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 18.7,
        "certification_date": "2025-01-15",
        "verification_status": "active",
        "total_volume_gallons": 1650000.0,
        "total_credits": 17601238049.999996
      },
      {
        "pathway_id": "CA-RD-2025-AGR-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "agricultural_residue",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 16.2,
        "certification_date": "2025-01-20",
        "verification_status": "active",
        "total_volume_gallons": 2350000.0,
        "total_credits": 25883292450.0
      },
      {
        "pathway_id": "CA-RD-2025-GRW-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "municipal_green_waste",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 14.5,
        "certification_date": "2025-02-01",
        "verification_status": "active",
        "total_volume_gallons": 650000.0,
        "total_credits": 7312472050.0
      },
      {
        "pathway_id": "CA-RD-2025-FHR-001",
        "pathway_type": "Tier_1",
        "feedstock_category": "forest_harvest_residual",
        "fuel_product": "renewable_diesel",
        "carbon_intensity": 21.3,
        "certification_date": "2025-01-10",
        "verification_status": "active",
        "total_volume_gallons": 425000.0,
        "total_credits": 4380388725.0
      }
    ],
    "verification": {
      "verifier_name": "Environmental Resources Management",
      "verification_date": "2025-04-10T10:00:00Z",
      "verification_opinion": "Unqualified",
      "verification_scope": "Complete Q1 2025 renewable diesel production and sales"
    }
  }
}
</pre>
</div>
</div>
</div>
