programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
* Data Validation and Compliance Checks

Implement comprehensive validation to ensure data quality and regulatory compliance.

** Entity Validation Functions

#+begin_src python :session lcfs-analysis
def validate_organization(org_data):
    """Validate Organization entity for LCFS compliance"""
    required_fields = ['organizationId', 'name', 'lcfsRegistrationId', 'regulatedEntityType']
    errors = []
    
    for field in required_fields:
        if field not in org_data:
            errors.append(f"Missing required field: {field}")
    
    if 'lcfsRegistrationId' in org_data:
        if not org_data['lcfsRegistrationId'].startswith('LCFS-REG-'):
            errors.append("Invalid LCFS registration ID format")
    
    valid_entity_types = ['producer', 'importer', 'blender', 'distributor']
    if org_data.get('regulatedEntityType') not in valid_entity_types:
        errors.append(f"Invalid entity type. Must be one of: {valid_entity_types}")
    
    return errors

def validate_transaction(txn_data, pathways_lookup):
    """Validate Transaction entity for LCFS compliance"""
    errors = []
    
    required_fields = ['transactionId', 'fuelVolume', 'fuelVolumeUnit', 
                      'fuelCategory', 'reportingPeriod', 'lcfsPathwayId']
    
    for field in required_fields:
        if field not in txn_data:
            errors.append(f"Missing required field: {field}")
    
    # Validate fuel volume
    if txn_data.get('fuelVolume', 0) <= 0:
        errors.append("Fuel volume must be greater than 0")
    
    # Validate pathway reference
    pathway_id = txn_data.get('lcfsPathwayId')
    if pathway_id and pathway_id not in pathways_lookup:
        errors.append(f"Referenced pathway {pathway_id} not found")
    elif pathway_id and pathways_lookup[pathway_id]['verificationStatus'] != 'active':
        errors.append(f"Pathway {pathway_id} is not active")
    
    # Validate reporting period format
    reporting_period = txn_data.get('reportingPeriod', '')
    if not reporting_period.match(r'^\d{4}-Q[1-4]$'):
        errors.append("Invalid reporting period format (should be YYYY-QN)")
    
    return errors

def validate_pathway(pathway_data):
    """Validate LCFSPathway entity"""
    errors = []
    
    required_fields = ['pathwayId', 'pathwayType', 'feedstockCategory', 
                      'carbonIntensity', 'energyEconomyRatio']
    
    for field in required_fields:
        if field not in pathway_data:
            errors.append(f"Missing required field: {field}")
    
    # Validate CI value
    ci = pathway_data.get('carbonIntensity', 0)
    if not (0 < ci < 1000):
        errors.append("Carbon intensity must be between 0 and 1000 gCO2e/MJ")
    
    # Validate EER
    eer = pathway_data.get('energyEconomyRatio', 0)
    if not (0 < eer <= 10):
        errors.append("Energy Economy Ratio must be between 0 and 10")
    
    return errors

print("Validation Functions Loaded ✓")
#+end_src

#+RESULTS:
: Validation Functions Loaded ✓

