programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org60a2ec5" class="outline-2">
<h2 id="org60a2ec5"><span class="section-number-2">10.</span> Data Validation and Compliance Checks</h2>
<div class="outline-text-2" id="text-10">
<p>
Implement comprehensive validation to ensure data quality and regulatory compliance.
</p>
</div>
<div id="outline-container-org568eefc" class="outline-3">
<h3 id="org568eefc"><span class="section-number-3">10.1.</span> Entity Validation Functions</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF; font-weight: bold;">def</span> <span style="color: #006699;">validate_organization</span>(org_data):
    <span style="color: #036A07;">"""Validate Organization entity for LCFS compliance"""</span>
    <span style="color: #BA36A5;">required_fields</span> = [<span style="color: #008000;">'organizationId'</span>, <span style="color: #008000;">'name'</span>, <span style="color: #008000;">'lcfsRegistrationId'</span>, <span style="color: #008000;">'regulatedEntityType'</span>]
    <span style="color: #BA36A5;">errors</span> = []
    
    <span style="color: #0000FF; font-weight: bold;">for</span> field <span style="color: #0000FF; font-weight: bold;">in</span> required_fields:
        <span style="color: #0000FF; font-weight: bold;">if</span> field <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> org_data:
            errors.append(f<span style="color: #008000;">"Missing required field: </span>{field}<span style="color: #008000;">"</span>)
    
    <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #008000;">'lcfsRegistrationId'</span> <span style="color: #0000FF; font-weight: bold;">in</span> org_data:
        <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #0000FF; font-weight: bold;">not</span> org_data[<span style="color: #008000;">'lcfsRegistrationId'</span>].startswith(<span style="color: #008000;">'LCFS-REG-'</span>):
            errors.append(<span style="color: #008000;">"Invalid LCFS registration ID format"</span>)
    
    <span style="color: #BA36A5;">valid_entity_types</span> = [<span style="color: #008000;">'producer'</span>, <span style="color: #008000;">'importer'</span>, <span style="color: #008000;">'blender'</span>, <span style="color: #008000;">'distributor'</span>]
    <span style="color: #0000FF; font-weight: bold;">if</span> org_data.get(<span style="color: #008000;">'regulatedEntityType'</span>) <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> valid_entity_types:
        errors.append(f<span style="color: #008000;">"Invalid entity type. Must be one of: </span>{valid_entity_types}<span style="color: #008000;">"</span>)
    
    <span style="color: #0000FF; font-weight: bold;">return</span> errors

<span style="color: #0000FF; font-weight: bold;">def</span> <span style="color: #006699;">validate_transaction</span>(txn_data, pathways_lookup):
    <span style="color: #036A07;">"""Validate Transaction entity for LCFS compliance"""</span>
    <span style="color: #BA36A5;">errors</span> = []
    
    <span style="color: #BA36A5;">required_fields</span> = [<span style="color: #008000;">'transactionId'</span>, <span style="color: #008000;">'fuelVolume'</span>, <span style="color: #008000;">'fuelVolumeUnit'</span>, 
                      <span style="color: #008000;">'fuelCategory'</span>, <span style="color: #008000;">'reportingPeriod'</span>, <span style="color: #008000;">'lcfsPathwayId'</span>]
    
    <span style="color: #0000FF; font-weight: bold;">for</span> field <span style="color: #0000FF; font-weight: bold;">in</span> required_fields:
        <span style="color: #0000FF; font-weight: bold;">if</span> field <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> txn_data:
            errors.append(f<span style="color: #008000;">"Missing required field: </span>{field}<span style="color: #008000;">"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate fuel volume</span>
    <span style="color: #0000FF; font-weight: bold;">if</span> txn_data.get(<span style="color: #008000;">'fuelVolume'</span>, 0) &lt;= 0:
        errors.append(<span style="color: #008000;">"Fuel volume must be greater than 0"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate pathway reference</span>
    <span style="color: #BA36A5;">pathway_id</span> = txn_data.get(<span style="color: #008000;">'lcfsPathwayId'</span>)
    <span style="color: #0000FF; font-weight: bold;">if</span> pathway_id <span style="color: #0000FF; font-weight: bold;">and</span> pathway_id <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> pathways_lookup:
        errors.append(f<span style="color: #008000;">"Referenced pathway </span>{pathway_id}<span style="color: #008000;"> not found"</span>)
    <span style="color: #0000FF; font-weight: bold;">elif</span> pathway_id <span style="color: #0000FF; font-weight: bold;">and</span> pathways_lookup[pathway_id][<span style="color: #008000;">'verificationStatus'</span>] != <span style="color: #008000;">'active'</span>:
        errors.append(f<span style="color: #008000;">"Pathway </span>{pathway_id}<span style="color: #008000;"> is not active"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate reporting period format</span>
    <span style="color: #BA36A5;">reporting_period</span> = txn_data.get(<span style="color: #008000;">'reportingPeriod'</span>, <span style="color: #008000;">''</span>)
    <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #0000FF; font-weight: bold;">not</span> reporting_period.<span style="color: #0000FF; font-weight: bold;">match</span>(r<span style="color: #008000;">'^\d{4}-Q[1-4]$'</span>):
        errors.append(<span style="color: #008000;">"Invalid reporting period format (should be YYYY-QN)"</span>)
    
    <span style="color: #0000FF; font-weight: bold;">return</span> errors

<span style="color: #0000FF; font-weight: bold;">def</span> <span style="color: #006699;">validate_pathway</span>(pathway_data):
    <span style="color: #036A07;">"""Validate LCFSPathway entity"""</span>
    <span style="color: #BA36A5;">errors</span> = []
    
    <span style="color: #BA36A5;">required_fields</span> = [<span style="color: #008000;">'pathwayId'</span>, <span style="color: #008000;">'pathwayType'</span>, <span style="color: #008000;">'feedstockCategory'</span>, 
                      <span style="color: #008000;">'carbonIntensity'</span>, <span style="color: #008000;">'energyEconomyRatio'</span>]
    
    <span style="color: #0000FF; font-weight: bold;">for</span> field <span style="color: #0000FF; font-weight: bold;">in</span> required_fields:
        <span style="color: #0000FF; font-weight: bold;">if</span> field <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> pathway_data:
            errors.append(f<span style="color: #008000;">"Missing required field: </span>{field}<span style="color: #008000;">"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate CI value</span>
    <span style="color: #BA36A5;">ci</span> = pathway_data.get(<span style="color: #008000;">'carbonIntensity'</span>, 0)
    <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #0000FF; font-weight: bold;">not</span> (0 &lt; ci &lt; 1000):
        errors.append(<span style="color: #008000;">"Carbon intensity must be between 0 and 1000 gCO2e/MJ"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate EER</span>
    <span style="color: #BA36A5;">eer</span> = pathway_data.get(<span style="color: #008000;">'energyEconomyRatio'</span>, 0)
    <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #0000FF; font-weight: bold;">not</span> (0 &lt; eer &lt;= 10):
        errors.append(<span style="color: #008000;">"Energy Economy Ratio must be between 0 and 10"</span>)
    
    <span style="color: #0000FF; font-weight: bold;">return</span> errors

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"Validation Functions Loaded &#10003;"</span>)
</pre>
</div>

<pre class="example">
Validation Functions Loaded ✓
</pre>
</div>
</div>
