programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.org
** Comprehensive Data Validation

#+begin_src python :session lcfs-analysis
# Comprehensive validation using session data

# Use data already loaded in session
org_data = organization_data
pathways_lookup = pathway_lookup

print("LCFS Data Validation Report:")
print("="*35)

# Validate organization
print("1. Organization Validation:")
org_errors = validate_organization(org_data)
if org_errors:
    for error in org_errors:
        print(f"   ✗ {error}")
else:
    print("   ✓ Organization data valid")

# Validate pathways
print("\n2. Pathway Validation:")
pathway_errors = 0
for pathway in pathways_data:
    errors = validate_pathway(pathway)
    if errors:
        print(f"   Pathway {pathway['pathwayId']}:")
        for error in errors:
            print(f"     ✗ {error}")
            pathway_errors += 1

if pathway_errors == 0:
    print("   ✓ All pathways valid")

# Validate transactions  
print("\n3. Transaction Validation:")
transaction_errors = 0

# Fix regex pattern for reporting period validation
def validate_reporting_period(period):
    pattern = r'^\d{4}-Q[1-4]$'
    return bool(re.match(pattern, period))

for txn in transactions_data:
    errors = []
    
    # Basic field validation
    required_fields = ['transactionId', 'fuelVolume', 'fuelVolumeUnit', 
                      'fuelCategory', 'reportingPeriod', 'lcfsPathwayId']
    
    for field in required_fields:
        if field not in txn:
            errors.append(f"Missing required field: {field}")
    
    # Validate fuel volume
    if txn.get('fuelVolume', 0) <= 0:
        errors.append("Fuel volume must be greater than 0")
    
    # Validate pathway reference
    pathway_id = txn.get('lcfsPathwayId')
    if pathway_id and pathway_id not in pathways_lookup:
        errors.append(f"Referenced pathway {pathway_id} not found")
    elif pathway_id and pathways_lookup[pathway_id]['verificationStatus'] != 'active':
        errors.append(f"Pathway {pathway_id} is not active")
    
    # Validate reporting period format
    reporting_period = txn.get('reportingPeriod', '')
    if not validate_reporting_period(reporting_period):
        errors.append("Invalid reporting period format (should be YYYY-QN)")
    
    if errors:
        print(f"   Transaction {txn['transactionId']}:")
        for error in errors:
            print(f"     ✗ {error}")
            transaction_errors += 1

if transaction_errors == 0:
    print("   ✓ All transactions valid")

# Cross-validation checks
print("\n4. Cross-Validation Checks:")

# Check total volume vs pathway limits
pathway_volumes = {}
for txn in transactions_data:
    pathway_id = txn['lcfsPathwayId']
    if pathway_id not in pathway_volumes:
        pathway_volumes[pathway_id] = 0
    pathway_volumes[pathway_id] += txn['fuelVolume']

volume_warnings = 0
for pathway_id, volume in pathway_volumes.items():
    annual_limit = pathways_lookup[pathway_id]['annualVolumeLimit']
    q1_limit = annual_limit / 4  # Assume even quarterly distribution
    
    if volume > q1_limit * 1.5:  # Allow 50% variance
        print(f"   ⚠ Pathway {pathway_id}: Q1 volume ({volume:,}) high vs expected quarterly limit ({q1_limit:,})")
        volume_warnings += 1

if volume_warnings == 0:
    print("   ✓ Volume distributions reasonable")

# Check CI consistency
print("\n5. Carbon Intensity Consistency:")
ci_issues = 0
for pathway in pathways_data:
    pathway_id = pathway['pathwayId']
    feedstock = pathway['feedstockCategory']
    ci = pathway['carbonIntensity']
    
    # Basic CI range checks by feedstock type
    if 'green_waste' in feedstock and ci > 20:
        print(f"   ⚠ {pathway_id}: CI ({ci}) high for green waste feedstock")
        ci_issues += 1
    elif 'forest' in feedstock and ci > 25:
        print(f"   ⚠ {pathway_id}: CI ({ci}) high for forest residue")
        ci_issues += 1

if ci_issues == 0:
    print("   ✓ Carbon intensity values reasonable")

print(f"\nValidation Summary:")
print(f"✓ Organization: Valid")
print(f"✓ Pathways: {len(pathways_data)} validated")
print(f"✓ Transactions: {len(transactions_data)} validated")
print(f"✓ Cross-checks: Completed")
print("✓ Ready for CARB submission")
#+end_src

#+RESULTS:
#+begin_example
LCFS Data Validation Report:
===================================
1. Organization Validation:
   ✓ Organization data valid

2. Pathway Validation:
   ✓ All pathways valid

3. Transaction Validation:
   ✓ All transactions valid

4. Cross-Validation Checks:
   ✓ Volume distributions reasonable

5. Carbon Intensity Consistency:
   ✓ Carbon intensity values reasonable

Validation Summary:
✓ Organization: Valid
✓ Pathways: 4 validated
✓ Transactions: 6 validated
✓ Cross-checks: Completed
✓ Ready for CARB submission
#+end_example

