programs/lcfs/examples/pacific_renewable_fuels_lcfs_example.html
<div id="outline-container-org1c3bb34" class="outline-3">
<h3 id="org1c3bb34"><span class="section-number-3">10.2.</span> Comprehensive Data Validation</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Comprehensive validation using session data</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Use data already loaded in session</span>
<span style="color: #BA36A5;">org_data</span> = organization_data
<span style="color: #BA36A5;">pathways_lookup</span> = pathway_lookup

<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"LCFS Data Validation Report:"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"="</span>*35)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate organization</span>
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"1. Organization Validation:"</span>)
<span style="color: #BA36A5;">org_errors</span> = validate_organization(org_data)
<span style="color: #0000FF; font-weight: bold;">if</span> org_errors:
    <span style="color: #0000FF; font-weight: bold;">for</span> error <span style="color: #0000FF; font-weight: bold;">in</span> org_errors:
        <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   &#10007; </span>{error}<span style="color: #008000;">"</span>)
<span style="color: #0000FF; font-weight: bold;">else</span>:
    <span style="color: #006FE0;">print</span>(<span style="color: #008000;">"   &#10003; Organization data valid"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate pathways</span>
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">2. Pathway Validation:"</span>)
<span style="color: #BA36A5;">pathway_errors</span> = 0
<span style="color: #0000FF; font-weight: bold;">for</span> pathway <span style="color: #0000FF; font-weight: bold;">in</span> pathways_data:
    <span style="color: #BA36A5;">errors</span> = validate_pathway(pathway)
    <span style="color: #0000FF; font-weight: bold;">if</span> errors:
        <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   Pathway </span>{pathway['pathwayId']}<span style="color: #008000;">:"</span>)
        <span style="color: #0000FF; font-weight: bold;">for</span> error <span style="color: #0000FF; font-weight: bold;">in</span> errors:
            <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"     &#10007; </span>{error}<span style="color: #008000;">"</span>)
            <span style="color: #BA36A5;">pathway_errors</span> += 1

<span style="color: #0000FF; font-weight: bold;">if</span> pathway_errors == 0:
    <span style="color: #006FE0;">print</span>(<span style="color: #008000;">"   &#10003; All pathways valid"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate transactions  </span>
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">3. Transaction Validation:"</span>)
<span style="color: #BA36A5;">transaction_errors</span> = 0

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Fix regex pattern for reporting period validation</span>
<span style="color: #0000FF; font-weight: bold;">def</span> <span style="color: #006699;">validate_reporting_period</span>(period):
    <span style="color: #BA36A5;">pattern</span> = r<span style="color: #008000;">'^\d{4}-Q[1-4]$'</span>
    <span style="color: #0000FF; font-weight: bold;">return</span> <span style="color: #006FE0;">bool</span>(re.<span style="color: #0000FF; font-weight: bold;">match</span>(pattern, period))

<span style="color: #0000FF; font-weight: bold;">for</span> txn <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data:
    <span style="color: #BA36A5;">errors</span> = []
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Basic field validation</span>
    <span style="color: #BA36A5;">required_fields</span> = [<span style="color: #008000;">'transactionId'</span>, <span style="color: #008000;">'fuelVolume'</span>, <span style="color: #008000;">'fuelVolumeUnit'</span>, 
                      <span style="color: #008000;">'fuelCategory'</span>, <span style="color: #008000;">'reportingPeriod'</span>, <span style="color: #008000;">'lcfsPathwayId'</span>]
    
    <span style="color: #0000FF; font-weight: bold;">for</span> field <span style="color: #0000FF; font-weight: bold;">in</span> required_fields:
        <span style="color: #0000FF; font-weight: bold;">if</span> field <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> txn:
            errors.append(f<span style="color: #008000;">"Missing required field: </span>{field}<span style="color: #008000;">"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate fuel volume</span>
    <span style="color: #0000FF; font-weight: bold;">if</span> txn.get(<span style="color: #008000;">'fuelVolume'</span>, 0) &lt;= 0:
        errors.append(<span style="color: #008000;">"Fuel volume must be greater than 0"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate pathway reference</span>
    <span style="color: #BA36A5;">pathway_id</span> = txn.get(<span style="color: #008000;">'lcfsPathwayId'</span>)
    <span style="color: #0000FF; font-weight: bold;">if</span> pathway_id <span style="color: #0000FF; font-weight: bold;">and</span> pathway_id <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> pathways_lookup:
        errors.append(f<span style="color: #008000;">"Referenced pathway </span>{pathway_id}<span style="color: #008000;"> not found"</span>)
    <span style="color: #0000FF; font-weight: bold;">elif</span> pathway_id <span style="color: #0000FF; font-weight: bold;">and</span> pathways_lookup[pathway_id][<span style="color: #008000;">'verificationStatus'</span>] != <span style="color: #008000;">'active'</span>:
        errors.append(f<span style="color: #008000;">"Pathway </span>{pathway_id}<span style="color: #008000;"> is not active"</span>)
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Validate reporting period format</span>
    <span style="color: #BA36A5;">reporting_period</span> = txn.get(<span style="color: #008000;">'reportingPeriod'</span>, <span style="color: #008000;">''</span>)
    <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #0000FF; font-weight: bold;">not</span> validate_reporting_period(reporting_period):
        errors.append(<span style="color: #008000;">"Invalid reporting period format (should be YYYY-QN)"</span>)
    
    <span style="color: #0000FF; font-weight: bold;">if</span> errors:
        <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   Transaction </span>{txn['transactionId']}<span style="color: #008000;">:"</span>)
        <span style="color: #0000FF; font-weight: bold;">for</span> error <span style="color: #0000FF; font-weight: bold;">in</span> errors:
            <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"     &#10007; </span>{error}<span style="color: #008000;">"</span>)
            <span style="color: #BA36A5;">transaction_errors</span> += 1

<span style="color: #0000FF; font-weight: bold;">if</span> transaction_errors == 0:
    <span style="color: #006FE0;">print</span>(<span style="color: #008000;">"   &#10003; All transactions valid"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Cross-validation checks</span>
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">4. Cross-Validation Checks:"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check total volume vs pathway limits</span>
<span style="color: #BA36A5;">pathway_volumes</span> = {}
<span style="color: #0000FF; font-weight: bold;">for</span> txn <span style="color: #0000FF; font-weight: bold;">in</span> transactions_data:
    <span style="color: #BA36A5;">pathway_id</span> = txn[<span style="color: #008000;">'lcfsPathwayId'</span>]
    <span style="color: #0000FF; font-weight: bold;">if</span> pathway_id <span style="color: #0000FF; font-weight: bold;">not</span> <span style="color: #0000FF; font-weight: bold;">in</span> pathway_volumes:
        <span style="color: #BA36A5;">pathway_volumes</span>[pathway_id] = 0
    <span style="color: #BA36A5;">pathway_volumes</span>[pathway_id] += txn[<span style="color: #008000;">'fuelVolume'</span>]

<span style="color: #BA36A5;">volume_warnings</span> = 0
<span style="color: #0000FF; font-weight: bold;">for</span> pathway_id, volume <span style="color: #0000FF; font-weight: bold;">in</span> pathway_volumes.items():
    <span style="color: #BA36A5;">annual_limit</span> = pathways_lookup[pathway_id][<span style="color: #008000;">'annualVolumeLimit'</span>]
    <span style="color: #BA36A5;">q1_limit</span> = annual_limit / 4  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Assume even quarterly distribution</span>
    
    <span style="color: #0000FF; font-weight: bold;">if</span> volume &gt; q1_limit * 1.5:  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Allow 50% variance</span>
        <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   &#9888; Pathway </span>{pathway_id}<span style="color: #008000;">: Q1 volume (</span>{volume:,}<span style="color: #008000;">) high vs expected quarterly limit (</span>{q1_limit:,}<span style="color: #008000;">)"</span>)
        <span style="color: #BA36A5;">volume_warnings</span> += 1

<span style="color: #0000FF; font-weight: bold;">if</span> volume_warnings == 0:
    <span style="color: #006FE0;">print</span>(<span style="color: #008000;">"   &#10003; Volume distributions reasonable"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Check CI consistency</span>
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">5. Carbon Intensity Consistency:"</span>)
<span style="color: #BA36A5;">ci_issues</span> = 0
<span style="color: #0000FF; font-weight: bold;">for</span> pathway <span style="color: #0000FF; font-weight: bold;">in</span> pathways_data:
    <span style="color: #BA36A5;">pathway_id</span> = pathway[<span style="color: #008000;">'pathwayId'</span>]
    <span style="color: #BA36A5;">feedstock</span> = pathway[<span style="color: #008000;">'feedstockCategory'</span>]
    <span style="color: #BA36A5;">ci</span> = pathway[<span style="color: #008000;">'carbonIntensity'</span>]
    
    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Basic CI range checks by feedstock type</span>
    <span style="color: #0000FF; font-weight: bold;">if</span> <span style="color: #008000;">'green_waste'</span> <span style="color: #0000FF; font-weight: bold;">in</span> feedstock <span style="color: #0000FF; font-weight: bold;">and</span> ci &gt; 20:
        <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   &#9888; </span>{pathway_id}<span style="color: #008000;">: CI (</span>{ci}<span style="color: #008000;">) high for green waste feedstock"</span>)
        <span style="color: #BA36A5;">ci_issues</span> += 1
    <span style="color: #0000FF; font-weight: bold;">elif</span> <span style="color: #008000;">'forest'</span> <span style="color: #0000FF; font-weight: bold;">in</span> feedstock <span style="color: #0000FF; font-weight: bold;">and</span> ci &gt; 25:
        <span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"   &#9888; </span>{pathway_id}<span style="color: #008000;">: CI (</span>{ci}<span style="color: #008000;">) high for forest residue"</span>)
        <span style="color: #BA36A5;">ci_issues</span> += 1

<span style="color: #0000FF; font-weight: bold;">if</span> ci_issues == 0:
    <span style="color: #006FE0;">print</span>(<span style="color: #008000;">"   &#10003; Carbon intensity values reasonable"</span>)

<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"</span><span style="color: #D0372D;">\n</span><span style="color: #008000;">Validation Summary:"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Organization: Valid"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Pathways: </span>{<span style="color: #006FE0;">len</span>(pathways_data)}<span style="color: #008000;"> validated"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Transactions: </span>{<span style="color: #006FE0;">len</span>(transactions_data)}<span style="color: #008000;"> validated"</span>)
<span style="color: #006FE0;">print</span>(f<span style="color: #008000;">"&#10003; Cross-checks: Completed"</span>)
<span style="color: #006FE0;">print</span>(<span style="color: #008000;">"&#10003; Ready for CARB submission"</span>)
</pre>
</div>

<pre class="example" id="org4350329">
LCFS Data Validation Report:
===================================
1. Organization Validation:
   ✓ Organization data valid

2. Pathway Validation:
   ✓ All pathways valid

3. Transaction Validation:
   ✓ All transactions valid

4. Cross-Validation Checks:
   ✓ Volume distributions reasonable

5. Carbon Intensity Consistency:
   ✓ Carbon intensity values reasonable

Validation Summary:
✓ Organization: Valid
✓ Pathways: 4 validated
✓ Transactions: 6 validated
✓ Cross-checks: Completed
✓ Ready for CARB submission
</pre>
</div>
</div>
</div>
